[{"id":1,"title":"Röyksopp &amp; Robyn","content":"We are more than a little bit excited to announce that our very own pop-duchess Robyn and her long-time musical collaborators the phenomenal production duo Röyksopp are joining forces once again on their upcoming ‘Do it Again Tour’ of Europe and North America, choosing Way Out West as one of their selected stop-offs!\r\n\r\nThe news will no doubt delight Robyn fans desperate for the follow-up to the 2010 three-part, 5 Swedish Grammy winning opus that was, ‘Body Talk’ as well as her work with I Blame Coco and Snoop Dog. Whilst the Norwegian duo have 4 astounding albums under their belt and have delighted fans with their past collaborations with Lykke Li and The Knife’s Karin Dreijer Andersson.\r\n\r\nHaving seen the results of Robyn’s astonishing alliance with Svein Berge and Torbjorn Brundtland before on the 2009 singles, ‘The Girl and the Robot’ and ‘None of Dem’, we know that this will be one awe-inspiring show, and we can only dream of what wonders they have been working on together. Do not miss this Scandinavian dream team in action at Way Out West.\r\n\r\n \r\n","spotify_url":null,"youtube_url":"http://www.youtube.com/watch?v=CHn7w3o22PA&amp;authuser=0","wayoutwest_url":"http://wayoutwest.se/artist/royksopp-robyn?lang=en","artist_url":"http://doitaga.in/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/robyn-royksopp.jpg","favorites":13,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":2,"title":"Janelle Monáe","content":"Things are going pretty well for Kansas native Janelle Monae, with a recent nomination for Best International Female Soloist at the UK Brit Awards, a invitation to the one and only Sesame Street and the acclaimed release of her second album, ‘The Electric Lady,’ the follow up to 2010s ‘The ArchAndroid,’ she can have a little spring in her step we think.\r\n\r\nBut Janelle Monae does more than spring, she catapults. Her albums offer an intensely wild listening experience from the maverick nature of her musical palette of futurist sounds, R&amp;B, sci-fi soul and seventies funk. Miss Monae also brings a few friends along for the ride including the one and only Prince, Erykah Badu, Solange and Miguel. She is known for throwing one hell of a party on stage, so grab your tuxedo and join us as we welcome Janelle Monae for a Summer time shindig, you won’t be disappointed.\r\n","spotify_url":null,"youtube_url":"http://youtu.be/tEddixS-UoU","wayoutwest_url":"http://wayoutwest.se/artist/janelle-monae?lang=en","artist_url":"http://open.spotify.com/artist/6ueGR6SWhUJfvEhqkvMsVs","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/janelle-monae.jpg","favorites":4,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":3,"title":"Neutral Milk Hotel","content":"Coming back to us after a 15-year absence, after the 1998 album ‘In the Aeroplane Over the Sea,’ Neutral Milk Hotel, with frontman and songwriter Jeff Magnum, bring their surreal folk musings back to life on their ever-growing reunion tour, and we can’t wait for them to wind their way to us at Way Out West.\r\n\r\nAfter his solo dates back in 2011, Magnum got the band (Scott Spillane, Julian Koster, and Jeremy Barnes) back together at the end of last year and where they once played clubs, they are now selling out theatres with their wondrous, somewhat fantastical, sometimes devastating sounds. On stage they are like an indie orchestra, swelling to 7 strong at times, before pulling back and handing the stage back to Magnum. The audiences that have stayed with them throughout their disappearance have only grown stronger and bigger and with near cult status and timeless appeal, we know it will have been worth the wait.\r\n","spotify_url":"http://open.spotify.com/artist/2ooIqOf4X2uz4mMptXCtie","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/neutral-milk-hotel?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/neutral-milk-hotel.jpg","favorites":8,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":4,"title":"Jonathan Wilson","content":"For his follow up to the 2011, widely acclaimed debut album, ‘ Gentle Spirit’, Jonathan Wilson called upon the crème de la crème of the Cali music scene with none other than David Crosby and David Nash coming on board along with a handful of other California greats.\r\n\r\nThe outcome is a like taking a trip to a chapel of 1970s soft rock and being bathed in a dream like, magical sermon. The moving sincerity of Wilsons west coast song writing accompanied by his folk, funk and jazz concoction with added congas, organs and bird noises creates a sound that blends so naturally its seems to float over you before dragging you back into the moment with a sudden change in tempo. He has previously been likened to sunset psychedlia, and what better place to experience it than in our very own Slottskogen. Join us and be mesmerized.\r\n","spotify_url":"http://open.spotify.com/artist/6KJIIOCWsWtNc7ICINtPEw","youtube_url":"http://youtu.be/tawWSAgLd_M","wayoutwest_url":"http://wayoutwest.se/artist/jonathan-wilson?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/JW_hemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":5,"title":"Jenny Wilson","content":"Our native pop songstress, and one time Knife affiliate, returned with aplomb at the end of last year with her fourth album, ‘Demand the Impossible,’ the formal follow up to her 2009 sophomore album, ‘Hardships!’ and my was it worth the wait. Inspired by an image of graffiti from the May 1968 Paris student protests Wilson stumbled upon in a magazine, she found herself drawn to the message of the words and her own struggle with breast cancer. Subsequently, she too started a rebellion, a rebellion against the illness that was attacking her body, and the spirit of this fight is instantly recognisable in her new work.\r\n\r\nTaking on the role of a street prophet, made manifest on the albums cover, by the artist Finsta, Wilson draws the listener into her journey, with an irrepressible rhythm section, tribal influences and an unexpected middle eastern vibe twinned with her unmistakable vocals. This is a powerful and bold statement and we can’t get enough of it. Wilson’s return is triumphant and we are thrilled to welcome her to Way out West.\r\n","spotify_url":"http://open.spotify.com/artist/3axEmcxTibioxD1rZi1IOB","youtube_url":"http://youtu.be/MTUk07TXbqU","wayoutwest_url":"http://wayoutwest.se/artist/jenny-wilson?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/jenny-wilson.jpg","favorites":7,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":6,"title":"Joey Bada$$","content":"När Joey Bada$$ släpptes sitt första mixtape ”1999” för snart två år sedan så häpnade många. Han var otroligt ung men lät som en gammal själ. Med ett flow som vi saknat sedan 90-talet tar han sig an att lägga en hel scen vid sina fötter. Föe ambitionerna hörs lång väg. I oktober 2010 lade Joey själv upp en video på YouTube där han freestylar. Klippet spreds och hamnade på sajten World Star Hip Hop där folk omedelbart uppmärksammar Bada$$. När hans första mixtape når undergroupscenen så bubblar den av entusiasm.\r\n\r\nJoey Bada$$ låter helt enkelt som om han kanaliserar A Tribe Called Quest, Mos Def och MF Doom från de år då de var som allra skarpast. Kanske ungefär när Mos Defs ”Black On Both Sides” släpptes, alltså långt innan Joey föddes. Född så sent som 1995 så rappar Brooklyn-sonen som the Progressive Era-kollektivets mest prominenta frontman med en tyngd som är sällsynt i en så ringa ålder. \r\n\r\nPro Era består nu av Joey själv och hans tidigare klasskamrater CJ Fly och Powers Pleasant. I december nåddes nämligen medlemmarna av nyheten att deras fjärde medlem, den otroligt begåvade och omtyckta Capital STEEZ, hade begått självmord. I samma veva tackade Joey Bada$$ nej till erbjudandet att bli en av artisterna i Jay Z:s stall på bolaget Roc Nation.\r\n\r\n2013 kom mixtape nummer två; ”Summer Knights”. Tankarna skickas omedelbart till A Tribe Called Quests ”Beats Rhymes &amp; Life”. Inte illa för en 19-åring från Brooklyn. Och under 2014 är det dags för debultalbumet ”B4.Da.$$” att nå oss. De som vet förutspår att Joey Bada$$ nu kommer att explodera på samma sätt som A$AP Rocky gjorde under de senaste åren. Och ja, vi håller med. Joey Bada$$ är nästan för bra för att vara sann. \r\n","spotify_url":"http://open.spotify.com/artist/2P5sC9cVZDToPxyomzF1UH","youtube_url":"http://youtu.be/6OiMq6Rau64","wayoutwest_url":"http://wayoutwest.se/artist/joey-bada$$?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/joey-badass.jpg","favorites":3,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":7,"title":"Queens of the Stone Age","content":"The kings of desert rock are coming to Gothenburg! The musical legend that is Josh Homme, the man of many musical projects, from his work with Eagles of Death Metal and Them Crooked Vultures, to producing records for the Arctic Monkeys, to featuring on tracks for The Strokes. This man is a musical maestro, but it is when he is playing with QOTSA that he is really at home.\r\n\r\nFormed in 1998, from the embers of the iconic Kyuss, Homme has seen this band through turbulent times, only to rise victorious with their aggressive punk and heavy metal inspired bombardments overlaid with Homme’s tender vocals. This Grammy nominated band have picked up many fans along the way, from Elton John and Dave Grohl to Trent Rezner and Jake Shears, all of whom they have collaborated with in some way, and it is clear that their appeal is wide reaching. We cannot wait to welcome them and their high-octane performances to Way Out West, it is sure to be one hell of a ride…\r\n","spotify_url":null,"youtube_url":"http://youtu.be/s88r_q7oufE","wayoutwest_url":"http://wayoutwest.se/artist/queens-of-the-stone-age?lang=en","artist_url":"http://open.spotify.com/artist/4pejUc4iciQfgdX6OKulQn","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/qotsa.jpg","favorites":10,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":8,"title":"Jungle","content":"One of the most exciting and mysterious bands to come out of the UK last year, the two-piece art collective and best friend duo known as T and J caused a bit of a frenzy with their video released singles ‘Platoon’ and ‘The Heat’. They sent Vimeo into meltdown - ‘Platoon’ has now reached a staggering 3.6 million plays, you have to check it out to catch the six year old dancer B-Girl Terra – as well as their first ever gig selling out in 24 hours on the basis of these blog released videos alone.\r\n\r\nYet we know relatively little about who these two guys actually are – but what we do know is that their hypnotic grooves and bewitching urban-tribal sounds are clouded in a post-punk attitude. It is austere whilst at the same time making you want to get your crazy dance moves on, handclaps and everything. They are planning on releasing an album this year, and we are waiting for it with baited breath. If you want to catch these elusive, mesmerising tribal- funk marvels, look no further than Way Out West this summer. \r\n","spotify_url":"http://open.spotify.com/artist/59oA5WbbQvomJz2BuRG071","youtube_url":"http://youtu.be/Y4UckOGdZtI","wayoutwest_url":"http://wayoutwest.se/artist/jungle?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/JUNGLE.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":9,"title":"The National","content":"The Brooklyn-based, Cincinnati born band of brothers (literally there are two sets of brothers in the band) have been forming their rich, real, accomplished sounds for over 15 years and on six albums. Back in the day there was a stint supporting R.E.M as well as some time spent on Obama’s campaign trail, but fast forward to 2013 and their recent nomination for a Grammy award for Best Alternative Album for their latest release, ‘Trouble Will Find Me’ and all we can say is its about time.\r\n\r\nFormed back in the 1990s post-punk revival, The National take inspiration from a wide range of influences from Americana to indie rock to brit-pop and create a sound that has been so richly crafted over the years that they really are unlike anyone else out there. Vocalist Matt Berninger and brothers Scott and Bryan Devendorf and Aaron and Bryce Dessner invite you into their personal and intimate journey like you are old dear friends, and when you do so their instantly memorable songs will have you hanging on their every word.\r\n","spotify_url":"http://open.spotify.com/artist/2cCUtGK9sDU2EoElnk0GNB","youtube_url":"http://youtu.be/yIWmRbHDhGw","wayoutwest_url":"http://wayoutwest.se/artist/the-national?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/the-national.jpg","favorites":9,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":10,"title":"Blood Orange","content":"Texan born, Essex bred and now residing in New York, the musical powerhouse that is Dev Hynes has written for the likes of Chemical Brothers and Florence and the Machine, worked with Sky Ferreira and Solange, had two different personal projects with The Icicles and the more familiar Lightsepeed Champion, and somehow found time to be a consultant for Jay-Z’s Rocawear brand.\r\n\r\nThe plethora of stylistic genres he has worked with could be seen as part of an on-going search for his solo sound, but in his second album from the Blood Orange project, his sound is crystal clear, taking you on an introspective, vulnerable journey that screams of NYC in the early 80s. Although he has all manner of collaborators on this album such as female vocalists Samantha Urbani and Chairlifts Caroline Polachek, as well as rappers Despot and Skepta, Hynes himself sings, plays bass, guitar, keyboards and drums and the resulting sound is very much his own. Let him and his melancholic wanderings take you on a nostalgic trip back to 1980s New York, its looking swell.\r\n","spotify_url":"http://open.spotify.com/artist/6LEeAFiJF8OuPx747e1wxR","youtube_url":"http://youtu.be/DfZMvTHJLUs","wayoutwest_url":"http://wayoutwest.se/artist/blood-orange?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/blood-orange.jpg","favorites":3,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":11,"title":"Deafheaven","content":"Formed back in 2010, this San Francisco based band, formed of George Clarke and Kerry McCoy with drummer Daniel Tracy playing on their last album, have been called ‘black metal-modifiers’, taking the genre somewhere others have never contemplated, or been able to. The expected anger and angst of metal cannon into areas of beauty that somehow take their tracks, some up to 12 minutes long, to a softer place, an unexpected place, a place you wished you had discovered long ago.\r\n\r\nTheir 2013 sophomore album ‘Sunbather’ with its summery salmon pink cover, catapulted them to the top of the class, quite literally, gaining consistently exceptional reviews from every major music channel. It is a 60-minute musical feast, taking inspiration from punk and hardcore as well as metal, spoken word and noise bursts, that take you on a journey inside their musical minds and spit you back out at the end, trust us, you will not want to be late for this ride.\r\n","spotify_url":"http://open.spotify.com/artist/4XpPveeg7RuYS3CgLo75t9","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/deafheaven?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/deafheaven.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":12,"title":"Circa Waves","content":"Circa Waves is a brash indie-rock band from Liverpool consisting of four young guys playing outrageous indie pop music while dressed in denim jackets. Does the description remind you of something? Yes, singer-songwriter Kieran Shuddal, guitarist Joe Dalconer, bassist Sam Rourke and drummer Sian Plummer truly brings back the revival of those early-nighties indie scene icons such as The Libertines and The Strokes, and we can't help to love it. Being only nine months old though, they’ve already established some sort of reputation and their forthcoming single ‘Get away’ released by the label Transgressive, has received great reviews in British media with praises like being the ‘hottest record in the world’. The story goes that they played some of their early gigs under pseudonyms to confuse hovering scouts and which created a real buzz about the upcoming band. Don’t miss them at Stay Out West this August. \r\n","spotify_url":"http://open.spotify.com/artist/6hl5k4gLl1p3sjhHcb57t2","youtube_url":"http://youtu.be/PnZ4tQXTxF8","wayoutwest_url":"http://wayoutwest.se/artist/circa-waves?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/circawaves.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":14,"title":"MØ","content":"Introducing the world to that strange looking letter Ø, Danish indie-pop powerhouse MØ is bringing her hand clapping, hair flipping, soulful/synth sounds to Way Out West and we can’t wait to welcome her.\r\n\r\nReleasing her eagerly awaited debut album in March after her highly successful ‘No Mythologies to Follow’ LP last year, MØ, aka Karen Marie Ørsted, quickly gained notoriety when she released tracks from 2013’s, ‘Bikini Daze’ with the infectious Diplo collaboration ‘XXX 88’. She has been likened to a mixture between Lykke Li, Grimes and Lana Del Ray, not a bad set of gals to be associated with in our opinion. However, MØ (which fyi translates to virgin in old Norse) drums to her own beat, flitting between grittily defiant and sweetly simple with ease, catering to a vast audience and as likely to be seen on the pages of NME as British Vogue, this industry darling is set for a meteoric rise and we are happy to go along for the ride.\r\n","spotify_url":"http://open.spotify.com/artist/0bdfiayQAKewqEvaU6rXCv","youtube_url":"http://youtu.be/bmLMPFXzBLA","wayoutwest_url":"http://wayoutwest.se/artist/mo?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/mo.jpg","favorites":5,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":16,"title":"Pusha T","content":"It’s not really plush cars, box fresh Nike shoes and glitter that one thinks of when Pusha T puts his mix tapes on. He is one broody dude, Terence. And if you consider his words and how the urge for riches has sent as good as every friend he ever had into prison, he is a rather lonely person. Pusha means that this has shaped him as an artist. Made his style dark. Pretty dark indeed.\r\n\r\nThere is something in that. Because if one listens to Pusha T’s technically brilliant east coast chant, it probably “mean” that pops in to your head – quickly followed by “sophisticated”, “full of variation”, and yes, we have to say it, “brilliant”. Pusha T’s lack of interest in pleasing anybody, while still producing incomprehensible hip-hop, will make him into one of the really big ones.\r\n\r\nNot that he is far away from that category today – if you want to know who is who in the hip hop elite you only have to look at Pushas comrades. Shall I start counting? The Neptunes, The-Dream, Kanye West, Swizz Beats… and that’s just some of the producers. On the debut album alone “My name is my name” that was eventually released after a few very hyped mix tapes, we hear Rick Ross, Kendrick Lamar, Pharell, 2 Chainz, amongst others.\r\n\r\nBut is this new for him? Oh no. Pusha T pushed mean east coast rhymes in filthy basements when the rest of us were sitting at home listening to grunge. But Clipse, that’s Pusha T and his brother Malice’s duo, is on ice while Malice – nowadays “No Malice” is busy finding salvation. There’s no risk that Pusha T will go down that road. He’s fully focused to channelling stories from his background into one of the hottest hip-hop this side of the decade.\r\n","spotify_url":"http://open.spotify.com/artist/0ONHkAv9pCAFxb0zJwDNTy","youtube_url":"http://youtu.be/-Evs0wwnuak","wayoutwest_url":"http://wayoutwest.se/artist/pusha-t?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/pusha_hemsida2.jpg","favorites":3,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":18,"title":"Brody Dalle","content":"Brody Dalle has a tattoo that says “Fuck Off” on her shoulder. That alone makes visiting Way Out West this year totally worth it. “Its important to tell people to fuck off” she means and in one sentence (and a tattoo) sums up her style, musically uncompromising and holding an appeal that radiates around her.\r\n\r\nBree Joanna Alice Robinson – Brody Dalle – embodies just the right balance of ‘f#*k you’ indifference and melody that we needed when The Destillers kicked the door into our lives in the early 2000’s. With a hissing nonchalance and the contagious simplicity of the band, led by the former elite swimmer, they have toted three records in the field between punk-rock and indie. The clear statement of intent was then, as it is now, that people should rather dance than tow the line.\r\n\r\nThat Brody Dalles solo outing was based on the same formula (listen to the brilliant “Meet the Foetus/Oh the joy”) is not that strange – she is who she is and the way she creates and performs on stage is rooted in her personal integrity. Her disregard for the normal and obvious ways to find her place in the music industry has seen her become more of a role model for women than any other superstars. Brody Dalles will never be reduced to swinging round a stripper pole in a video -for her communication and aggression are as important to music as passion and insanely catchy guitars.\r\n","spotify_url":"http://open.spotify.com/artist/2mGlvfts36oW5O7KKPzfLk","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/brody-dalle?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/brody-dalle.jpg","favorites":3,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":19,"title":"I Break Horses","content":"I BREAK HORSES is the musical project led by Maria Lindén. From her Stockholm base, the Swedish artist delivered an extraordinary debut album in the shape of ‘Hearts’, released by Bella Union in August 2011. Forward two years, and the arrival of an eagerly awaited follow-up, entitled Chiaroscuro, is upon us. The latest chapter in I Break Horses’ much celebrated songbook is everything fans could wish for and more. In the words of Lindén: “My only aim when starting to write this album was to ignore any possible second album expectations.” The result is a more confident and evolved sound with a more dramatic expression.\r\n","spotify_url":"http://open.spotify.com/artist/1H58rS29XotmFJWT3KCnl0","youtube_url":"http://youtu.be/BWmYpjWHT8E","wayoutwest_url":"http://wayoutwest.se/artist/i-break-horses?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/i-break-horses.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":20,"title":"Chlöe Howl","content":"18 year-old Howl came bounding out of the blocks earlier this year with her free download Rumour EP, a three-song set that rode the buzz blogs to Hypemachine chart glory and beyond, garnering early support from tastemakers at NME, Radio 1, the Guardian, Nylon, Pitchfork and Vogue, and racking up one million VEVO video views and counting.\r\n\r\nNo Strings - with its snappy refrain “no more crawling in your bed, fuck your no strings … I hope I have twins” - is the perfect calling card for the gobby girl from the suburbs. “I guess people don’t expect 18 year olds to own up and say: Oh hey guys! Yeah I drink alcohol and fool around,” Howl says. “I don’t see the point in pretending this kind of stuff isn’t going on and acting as though everything’s like Glee. I’m my age so I’m gonna talk about how gross it is to be my age”.\r\n","spotify_url":"http://open.spotify.com/artist/1hvPdvTeY6McdTvN4DyKGe","youtube_url":"http://youtu.be/wxrYmYyRMZk","wayoutwest_url":"http://wayoutwest.se/artist/chloe-howl?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/cholehowl.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":21,"title":"Forest Swords","content":"Liverpool’s enigmatic Forest Swords makes textured, gauzy music as indebted to the region’s rich musical heritage as it is the windswept and beautiful coastal environment from which it was born. The result is something completely organic, sounding like a mix of Massive Attack’s sample strewn claustrophobia, King Tubby’s sweating dub, with hints of Ennio Morricone’s legendary guitar soundscapes.\r\n\r\nAlbum ‘Engravings’, released in summer 2013 via Brooklyn electronic label Tri Angle (Holy Other, Evian Christ, The Haxan Cloak), saw Barnes refine and streamline his unique sound to huge critical acclaim, receiving praise from the likes of Pitchfork, Resident Advisor, The Guardian, Mixmag and FACT.\r\n","spotify_url":"http://open.spotify.com/artist/2VarlUiM6Lw0SA7BvwVPRP","youtube_url":"http://youtu.be/5SE8hH_EZbo","wayoutwest_url":"http://wayoutwest.se/artist/forest-swords?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/forest-swords.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":22,"title":"Holly Herndon","content":"Movement, Holly Herndon’s debut album on RVNG Intl., is a test chamber that hybridizes her modern composition training and undying devotion to club music. To this extent, the influences of Maryanne Amacher and Galina Ustvolskaya are as prevalent in Herndon’s music as Pan Sonic and Berlin and Birmingham 90s techno. Still, in line with pop deconstructionists Laurie Anderson and Art of Noise, Movement is purposefully positioned to reach new ears beyond a niche.\r\n","spotify_url":null,"youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/holly-herndon?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/holly-herndon.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":23,"title":"Machinedrum (DJ Set)","content":"North Carolina-born artist Travis Stewart known as Machinedrum has produced and composed over a dozen albums under various aliases since his first independent release in 1999. Covering an astonishing variety of styles with ease, through solo Machinedrum work and with collaborative projects Sepalcure, JETS, Dream Continuum, or other mutations, Stewart has established himself as electronic music’s true Renaissance man.\r\n","spotify_url":"http://open.spotify.com/artist/06xa1OLBsMQJFXcl2tQkH4","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/machinedrum?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/machinedrum.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":24,"title":"OutKast","content":"Hey. Ya.\r\n\r\nTwo words that, alone, don’t really mean anything all that interesting, but the minute they’re combined they become immediately familiar to, well, everybody. You've heard it a billion times, you can’t get it out of your head, you’ve danced crazily and happily until your dizzy, hummed it on the bus and sung along with it on the radio. You picture André 3000 in those green pants and polo attire and Big Boi as the suavely suited manager…  god wasn’t that video awesome?\r\n\r\nSince 2003, the tune has pursued us with its euphoric blend of silliness and sharpness, but ‘Hey Ya’ was hardly a one-off - with a 20-year career behind them, Outkast are as far as you can possibly get from a one hit wonder. In addition to 'Hey Ya's' brilliance on the eleven- time (!) Platinum-selling ‘Speakerboxx / The Love Below’ – this disparate pair have between them, released four other uber successful albums, won a full sack of Grammies - and appeared in a feature film!\r\n\r\n\"And imagine, all we wanted to do was rap! \" said André 3000 in the press release announcing Outkast’s return to the world, after eight years of silence. Now, when the duo is about to embark on a worldwide mega- tour to celebrate their 20th anniversary, which they will start by headlining the mythical Coachella festival in California, his statement seems a drastic simplification of what brought about Outkast, possibly one of modern music history’s most important groups; the endless creativity, defiance of the normal genre limitations and the pure joy of making music. Welcoming them to the Way Out West 2014 feels like proclaiming the coming of a musical Messiah.\r\n\r\nHey Ya everybody…. Hey Ya! \r\n","spotify_url":"http://open.spotify.com/artist/1G9G7WwrXka3Z1r7aIDjI7","youtube_url":"http://youtu.be/PWgvGjAhvIw ","wayoutwest_url":"http://wayoutwest.se/artist/outkast?lang=en","artist_url":"http://www.outkast.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/outkast.jpg","favorites":6,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":25,"title":"Mighty Oaks","content":"Catchy pop songs with folk roots Made in Berlin – available from the 14th of February. This day marks the release of \"Brother\", the lead single from MIGHTY OAKS debut album \"Howl\". The album will hit stores on the 28th of February, 2014.\r\n\r\nThe trio, made up of American Ian Hooper, Italian Claudio Donzelli and Brit Craig Saunders, has been making music together since 2010, and recently with ever-growing success. Singer-songwriter Ian comes from Washington, the northernmost state of the American West Coast. He grew up in a small town 40 miles south of Seattle, studied in Portland and then in Munich. He has been living permanently in Germany since 2008. He met his comrades Claudio and Craig at gigs in Hamburg. Gradually, all three moved to Berlin. After various study paths and jobs in Berlin – including a job in the Bundestag (!) – they decided to fully concentrate on music. And they were successful.\r\n\r\nIn its young history, the band MIGHTY OAKS have already stood on the same stages as the Lumineers, Chvrches and First Aid Kit; toured with the Shout Out Louds and were invited to open for Kings Of Leon at the Berlin Waldbühne. After the huge success of their self-released EP \"Just One Day\", they finally did their first tour of Germany, Austria and Switzerland in autumn 2013, selling out straight away.\r\n\r\n\"Brother\" is more than the sum of its parts for MIGHTY OAKS. Superficially, the song creates folk sounds with polyphonic harmonies, but thanks to its modern pop instrumentation, it's a powerful and fast-paced piece of music that is both contemplative and euphoric. \"It's a song about friendship. It is a nostalgic reflection upon the developmental stages in life and about having that one, true friend in life, that you know would do anything for you, and for whom you'd do anything\", Ian explains.\r\n\r\nAfter all, it's more than just thinking the same way that bound together this at first glance dissimilar trio. The three became best friends – brothers, even – through their mutual love of down-to-earth pop music, folk, and the great American songwriters of the 20th Century.\r\n\r\nThree-part vocal harmonies, acoustic guitars and mandolins are the core of MIGHTY OAKS songs. Smooth bass lines and simple drums are the pulse and heartbeat of the band's sound, while electric guitars give it depth and space. Layered on top are Hooper's melancholic but thoroughly hopeful lyrics celebrating adventure, freedom and love.\r\n\r\nThat's why the band will win hearts when \"Howl\" is released on 28/02/2014. Until then, we have \"Brother\" and the band mantra that it contains: \"I'll follow you to the end of the world, if only you would ask me to\".\r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/5AVJt6VYXT4hMRP8D3MRAC","youtube_url":"http://youtu.be/KOBVHdrfOkY","wayoutwest_url":"http://wayoutwest.se/artist/mighty-oaks?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/mighty-oaks.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":26,"title":"Little Dragon","content":"Since their inception in 1996, the Gothenburg quintet Little Dragon have slowly but surely grown bigger and captivated more audiences. Their real breakthrough was back in 2009 with the release of their second album ‘Machine Dreams’. Praise from both reviewers and international pundits were never ending and subsequently Damon Albarn invited the band to contribute to not only the Gorillaz album ‘Plastic Beach’ but also their worldwide tour in 2010. In 2011, came Little Dragons third album, ‘Ritual Union’ which, as before, received top marks and was followed up by a tour that spanned the world over. That same year their song ‘Twice’ was played in an episode of Greys Anatomy.\r\n\r\nLittle Dragon is the perfect blend of sweaty r’n’b, exciting new wave, grooving electronica and experimental pop. The fan base is thus far reaching from hip hoppers, ravers, stoners, hipsters and hippies. Among the more well known admirers you will find Big Boi (Outkast), Raphel Saadiq, Questlove (The Roots) and DJ Shadow.\r\n\r\nThe album recordings are of course fantastic, but it is on stage that Little Dragon are really in their element. The bands popular live shows are ingenious, tight and contain improvised fireworks of visible and invisible emotions that bubble away and then explode between the 4 friends onstage. Intrigued? Find out what we mean this August.\r\n","spotify_url":"http://open.spotify.com/artist/6Tyzp9KzpiZ04DABQoedps","youtube_url":"http://youtu.be/yedD4JsZyT0","wayoutwest_url":"http://wayoutwest.se/artist/little-dragon?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/little-dragon.jpg","favorites":4,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":28,"title":"Hozier","content":"Hozier was raised on the building blocks of popular music: rhythm and blues, soul, jazz and the deep dark stuff stretching from Chicago to the Delta. He joined his first band when he was 15 years old, fronting a soul band with some older heads. Taught himself to play guitar and piano, and went to Trinity College to study music but dropped out to concentrate his talents on the creative process full time. Hozier would go on to forge a musical identity he could call his own. A place where Stevie Wonder and Billie Holiday are revered alongside James Joyce and Oscar Wilde.He says: “Listen to any song, from any era; and you're looking through a keyhole into the artist's world as seen through their eyes. Art is, in its simplest\r\n\r\nform, the reproduction of the world around us. All artists reproduce their vision f the world, and in doing so create a document that reflects the times they live in”. Which brings us back to the Twenty First Century Blues, and Hozier's unique, poetic evocations. Hozier: singer of songs, teller of tales. It all begins here. His new EP is expected this Spring.\r\n\r\nwww.hozier.com\r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/2FXC3k01G6Gw61bmprjgqS","youtube_url":"http://youtu.be/MYSVMgRr6pw","wayoutwest_url":"http://wayoutwest.se/artist/hozier?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/hozier.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":29,"title":"NGUZUNGUZU","content":"The dynamic L.A. duo of Asma Maroof and Daniel Pineda return with their second EP for Fade to Mind. Fresh off the release of  NA’s solo debut Xtreme Tremble and three standout productions on Kelela’s CUT 4 ME mixtape, NGUZUNGUZU deliver a collection of seven bio-mechanically engineered heavy-hitting club experiments.\r\n\r\nEnter the paranoid universe of Skycell; a game you don’t know your playing, a hostile environment where your mind takes a vacation, but your body is in a cage. The songs of Skycell are built from air bursts, glimmering chimes, sunken bass, metallic scrapes, and industrial crashes. As the tension looms you begin to realize you are in an elevated jail cell with no bars, where your only escape is to free fall to your demise.\r\n\r\nCinematic intro “Foam Feathers” is a deceivingly innocent elevator ride to the top of the skycell, followed by “Harp Bell”‘s insistent claps, galloping kicks, and hypnotic chimes. “Break In” also uses the combination of deep 808 kicks and an ominous bell melody set off by high energy hi hats. “Tumultuous” and “Mecha” fill out the B-side of the EP with grimey mechanical percussion and densely layered samples over club kicks.\r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/5wJl2eFe6LqoSHSlk73vRr","youtube_url":"http://youtu.be/KGBNPfZMyVI","wayoutwest_url":"http://wayoutwest.se/artist/nguzunguzu?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/artists/nguzunguzu.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":30,"title":"Mark Ernestus presents Jeri-Jeri","content":"Mark Ernestus presents Jari-Jari is a catchy collaboration where stories are told through both text and by Sabar-drummers from Kaolack in Senegal. It features Senegalese legends such as Doudou Ndiaye Rose and Youssou N’Dours guitarist Baaba Maal. The result of this collaboration between Mark Ernestus and Jeri-Jeri is released on Berlin’s legendary 800% Ndagga and delivers a quite out of this world complexity and the hypnotic talking-drums of the Mbalax-style.\r\n\r\nMbalax, which is a fusion between traditional drum music from Senegal and Western music, has recently begun to gain recognition from further afield. In this latest offering the Jari-Jari music has spread to a whole new audience, and has done so since early 2011 when Ernestus travelled to Senegal and Gambia and was blown away by the local music scene. \r\n\r\nMark Ernestus presents Jari-Jari is hard groove, powerfully hypnotic with a musical palette that seems endless. Experience the drum filled nights that never end with the echo of Senegal in the distance.\r\n","spotify_url":"http://open.spotify.com/artist/4PJXLZh1FKCCiNlGy8vrel","youtube_url":"http://youtu.be/gfu3LuUw3HI","wayoutwest_url":"http://wayoutwest.se/artist/mark-ernestus-presents-jeri-jeri?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/mark_jerijeri.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":32,"title":"Icona Pop","content":"Icona Pop feel so international that sometimes it is hard to remember that they’re from Sweden. With their unpretentious coolness, galloping drums, insanely infectious indiepop melodies and New-Wave inspired, electro-house nuances, we defy anyone to resist them.\r\n\r\nThe duo, made-up of Aino Jawo and Caroline Hjelt, formed in 2009 and it took them mere months to get signed by the TEN Music Group. After a chance encounter at a party, when they immediately bonded over their common misfortune – Jawo had just been dumped and Hjelt was incapacitated with a leg injury caused by a freak beer-pong accident involving a trampoline – they wrote their first song the very next day. Four weeks later they had enough material to start recording.\r\n\r\nThe rest, as they say, is history. Everyone from your grandma to the suit sitting next to you on the bus has heard their summer hit ‘I Love It.’ It is actually one of only 3 Swedish singles to have gone platinum in the US, selling an awe-inspiring 2 million copies. The Guardian described their first single ‘Manners’ as ‘effortlessly cool,’ and with a second album under their belt and a gig supporting Miley Cyrus on her ‘Bangerz’ tour, you know that this is only the beginning for this irresistible duo, whether they are your guilty pleasure or not, you know you, sing it with me, ‘love it!’ \r\n","spotify_url":"http://open.spotify.com/artist/1VBflYyxBhnDc9uVib98rw","youtube_url":"http://youtu.be/UxxajLWwzqY","wayoutwest_url":"http://wayoutwest.se/artist/icona-pop?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/IconaPop_www.jpg","favorites":6,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":33,"title":"Bill Callahan","content":"Originally known for his project Smog, Callahan’s bittersweet and ascetic compositions are vivid and full of life. His album Dream River was chose as the MOJO Magazine’s Album of the Year 2013.\r\n\r\nBill Callahan has released an impressive number of albums, both under his own name and as Smog. All of his albums are rooted in folk, blues and country, with a lo-fi or indie twist\r\n\r\nPaste Magazine has written: – He’s a storyteller who could arguably be mentioned in the same breath as troubadours like Townes Van Zandt and Guy Clark, even Johnny Cash; although given his indie-rock pedigree, he’s more likely to remain, at least for the time being, in the fine company of Will Oldham and Richard Buckner.\r\n\r\nHas collaborated with other indie greats like Jim O’Rourke (Sonic Youth and more) , Neil Hagerty (Royal Trux ) and John McEntire (Tortoise / The Sea And Cake) . Callahan has been a critic favorite for years. \r\n","spotify_url":"http://open.spotify.com/artist/682LyslPNQ1DIHmJIN9H1P","youtube_url":"http://youtu.be/yYg6eIH7qR8","wayoutwest_url":"http://wayoutwest.se/artist/bill-callahan?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/bill-callahan.jpg","favorites":4,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":34,"title":"DARKSIDE","content":"Darkside make ponderous, somewhat haunting but all-consuming pearls of musical wondrousness. Swarming keyboards and strange audio recordings mix into insanely good drum arrangements. So far, so exceedingly good, but it doesn't stop there.\r\n\r\nThis is how it is: Nicholas Jaar, the mastermind behind Darkside is a genius. This is not a claim but an absolute truth. It doesn't have anything to do with his CV or the fact that he fact that he went to Brown, or that is a head honcho at his label Clown &amp; Sunset, or even that he was behind the BBC’s Essential Mix for 2012, among other successes.\r\n\r\nWhat makes Jaar a genius is his flair, mixed with something that is indescribable and incredibly difficult to put your finger on. He just is. At the age of 23 he has created more than many artists could in a lifetime. And it doesn't end with Darkside.. Darkside is a genre in itself.\r\n\r\nCurious? Good.\r\n\r\nOn Pitchfork they call Darkside music for “downtempo minimalism” and it is. It is a collaboration between Jaar and Brooklyn multi-instrumentalist and guitarist Dave Harrington. Together they create a dreamy electro foundation into which they bring piano, digitized vocals, cave sounds and rugged dub-funk, it is sensual, it attacks your senses in its slow build up until it has you totally consumed. This is music for the nocturnal times, music to lose yourself in and music only Jaar could have created. \r\n","spotify_url":"http://open.spotify.com/artist/2933wDUojoQmvqSdTAE5NB","youtube_url":"http://youtu.be/g3AMQCf4lj4","wayoutwest_url":"http://wayoutwest.se/artist/darkside?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Darkside_www.jpg","favorites":5,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":35,"title":"Ella Eyre","content":"Ella Eyre, the British singer who made ​​her name through her involvement in two of the 2013 major hit songs; Rudimentals \"Waiting All Night\" and the Naughty Boys \"Think About It\" where she is featuring along with rapper Wiz Khalifa. Her own first single \"Deeper\" is taken from the EP with the same name. Ella was nominated for both \"BBC Sound of 2014\", \"BRIT Awards 2014: Critics' Choice 'and' MTV Brand New For 2014.\" She has also previously worked with the Bastille and Tinie Tempah. Ella Eyre is a debutant to keep your eyes and ears open in 2014. \r\n","spotify_url":"http://open.spotify.com/artist/66TrUkUZ3RM29dqeDQRgyA","youtube_url":"http://youtu.be/lqPC3dmKFdw","wayoutwest_url":"http://wayoutwest.se/artist/ella-eyre?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/ella-eyre_www.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":36,"title":"Royal Blood","content":"Royal Blood make riff heavy, unashamedly loud, crowd thumping, floor shacking, rumbling rock - which is all the more impressive when you realise that there entire forte comes from only vocals, bass and drums. They have been likened to The White Stripes, but these boys are more inspired by Led Zeppelin and Queens of the Stone Age and are selling themselves on pure skill and stonking stage performances alone, gaining rave reviews and being chosen as the one and only rock nomination for the BBCs ‘Sound of 2014’ list.\r\n\r\nThey have also gained the support of none other than the Arctic Monkeys, with drummer Matt Helders wearing the bands t-shirt during their televised Glastonbury performance last summer, subsequently they have been signed on to support the band at their huge Finsbury Park shows this coming May. Not bad for a band that formed at the beginning of 2013. The story goes that Ben was picking Mike up from the airport and on the drive home they decided they would start a band, the next day they played their first gig, and this summer they are coming to Gothenburg. It’s been quite the journey so far and we know it has only just begun for these two bearded Brighton-based lads.\r\n","spotify_url":"http://open.spotify.com/artist/2S5hlvw4CMtMGswFtfdK15","youtube_url":"http://youtu.be/-_3mNCaJgNM","wayoutwest_url":"http://wayoutwest.se/artist/royal-blood?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/royal-blood_www.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":37,"title":"Tinariwen ","content":"","spotify_url":"http://open.spotify.com/artist/2sf2owtFSCvz2MLfxmNdkb","youtube_url":"http://youtu.be/DJbr0W8_X0k","wayoutwest_url":"http://wayoutwest.se/artist/tinariwen?lang=en","artist_url":"http://tinariwen.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/tinariwen.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":38,"title":"Veronica Maggio","content":"With the success of previous years no one could have escaped the Swedish pop dream Veronica Maggio. With awards such as ’Artist of the Year’ at P3 Gold and ’Pop of the Year’ at the Swedish Grammy’s the star has taken the Swedish soul pop genre to a whole new level. With the humbleness of any Swede the artist identifies herself as the girl who hides a soft and insecure interior behind a tough shell - something which is obvious from her lyrics and a metaphor carried by the entirety of Maggios last album, ”Handen i fickan fast jag bryr mig”. The Media, however, does not humbly agree, calling the star a true pop sensation with a magnificent live show, both visually and musically. A must-see at Way Out West 2014, our memories will be collected at #maggiolive and #wowgbg.\r\n","spotify_url":"http://open.spotify.com/artist/2OIWxN9xUhgUHkeUCWCaNs","youtube_url":"http://youtu.be/nPUtRUoW_Qc","wayoutwest_url":"http://wayoutwest.se/artist/veronica-maggio?lang=en","artist_url":"http://veronicamaggio.se/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Maggio_affisch_foto_henric_Lindsten.jpg","favorites":10,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":39,"title":"Sharon Van Etten","content":"Sharon Van Etten is worthy of worship. Her voice is as soft as velvet yet as sharp as a knife. Her music can say more in 5 minutes, than many literary works can in a hundred odd pages. How many other artists could you say that about?\r\n\r\nIt took a few years before Sharon Van Etten managed to save enough money and build up the courage to move out of her hometown of Clinton, New Jersey and into the big city and Brooklyn. Once there however, she wasted no time in getting to work on her dream; getting her music recorded and released. Her journey took her via Kyp Malone of TV On The Radio who told her to focus everything on her music and after she gave him a demo of her songs, that was that, Malone featured the pure genius that is Van Etten during his dj sessions.\r\n\r\nSharon released her debut album, ‘Because I Was in Love,’ in 2008, shortly after finishing up a tour with Meg Baird. It was a sparsely arranged record, allowing her vocals and guitar to really come into their own. It was at this point, or there abouts that things really took off for her, with Bon Iver doing covers of her songs and the release of her second album, ‘Epic’ in 2010. She then signed to the Jagjaguwar label and it was with the release of her 2012 album, ‘Tramp’ that her presence was cemented. Produced by The National’s Aaron Dessner and with guest turns from Wye Oaks’ Jenn Wasner, Julianna Barwick and Dessner’s brother and band mate Bruce. It was seen as sublime by both fans and reviewers alike.\r\n\r\nVan Etten has said that her music it is like a confession. With the rattling drums, frantic guitars, vocal harmonies and hard words, she gives the impression of a sermon that never leaves your soul once you hear it. This year brings the new album, ‘Are you There?’ We are and we can’t wait.\r\n\r\n \r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/2wJ4vsxWd7df7dRU4KcoDe","youtube_url":"http://youtu.be/WywIFyWyPTI","wayoutwest_url":"http://wayoutwest.se/artist/Sharon-Van-Etten?lang=en","artist_url":"http://sharonvanetten.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/sharon-hires-08.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":40,"title":"Mac DeMarco","content":"23-year old Mac Demarco once coined the term ”jizz jazz” to describe his creative style. Years of success and more than 60 000 Facebook likes later, this is the only artist biography to be found in his own media channels. ”Can’t claim to care / Never been reluctant to share” he muses in ”Passing Out Pieces” on his latest album. It is clear that he abides to the mantra: live as you learn.\r\n\r\nOn his lates releases Demarco has matured, relative to his early work which was critiques on grounds of crying out for attention with provocative, bordering on immature, lyrics. This is theorized to have influenced DeMarco who, in his later creations, have maintained the same lovably truncated yet funky tinkling sound - like The Kinks filtered through Kurt Vile or Bradford Cox - but soberly transforming the message into a thematically consistent entirety sun drenched filled with songs of a waisted youth - a maturity well received by both critics and fans. DeMarco may however be resistent in accepting this personal enlightenment - ”Don’t go telling me how this boy should be leading his own life” he chants in ”Goodbye Weekend”. \r\n","spotify_url":"http://open.spotify.com/artist/3Sz7ZnJQBIHsXLUSo0OQtM","youtube_url":"http://youtu.be/6bfTTeZOrs4","wayoutwest_url":"http://wayoutwest.se/artist/mac-demarco?lang=en","artist_url":"http://macdemarco.bandcamp.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/macdemarco1_robert-redfield.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":41,"title":"John Wizards","content":"South African John Wizars could have been fertilized in Maputo, but it could just as well have been in Capetown or Dar es Salaam. These are places where the band leader and producer, John Withers, has lived or visited which he feels has had a strong imprint on the music created by the band today. That he has trouble pin pointing the exact geographical heritage of the band is understandable since John Wizards music is inspired by an assortment of genres: South African house, R&amp;B, Shangaan Electro, Reggae, Afropop, Soukous, Rumba and Afrobeat to name a few.\r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/4sPLhyVBoVtdlX0MaetdVK","youtube_url":"http://youtu.be/zS8HHcYYWYE","wayoutwest_url":"http://wayoutwest.se/artist/john-wizards?lang=en","artist_url":"http://www.johnwizards.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/JohnWizards_2.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":42,"title":"Bo Ningen","content":"Japanese Bo Ningen seeks influences from the psychedelic underground scen of Tokyo as well as the modern rock of East London, where the band was founded in 2006. The result is an artsy punk-rock genre, unique in its direction, which persists to challenge and impress the listener with charged riffs, funk with a mathematically unprovable rhythm, and penetrating bass lines. Their look is enlightened and strange, though amazing, and perfects the conceptual entirety of all that is Bo Ningen. On-stage, Bo Ningen are four sock-less, skinny, Japanese dudes with black hair down to their waists and clothes in obscure shapes, colors and patterns. These guys are conceptual to the likes of Kraftwerk but are playing in a whole different field of the musical (and visual) spectra. Get the full Bo Ningen experience at Stay Out West 2014. \r\n","spotify_url":"http://open.spotify.com/artist/7bvXpj7XZfmaZ2HOcqgY1a","youtube_url":"http://youtu.be/kD9oSbcNW-c","wayoutwest_url":"http://wayoutwest.se/artist/bo-ningen?lang=en","artist_url":"http://boningen.info/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/BO_NINGEN_-_PRESS_SHOT_1_1350377605.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":43,"title":"Hessle Audio Label Night: Pearson Sound, Ben UFO, Pangaea","content":"UK based record label Hessle Audio, founded by David Kennedy (Pearson Sound, Ramadanman, Maurice Donovan), Ben Thomson (Ben UFO) and Kevin McAuley (Pangea), focuses on contemporary dance music. From its launch in 2007 the label has chummed out groundbreaking EPs and 12” for, aside from the founders own projects, also divergent electronic pioneers such as Blawan, James Blake and Untold. This year we are inviting you to a Hessle Audio label night at Stay Out West.\r\n\r\nPEARSON SOUND\r\nPearson Sound, David Kennedys electronic alias, has become synonymous with contemporary Brittish dance music. With the legendary alter egos Ramadanman (Dubstep) and Maurice Donovan (Chicago House) in his back, Kennedy has shown a genius independent of genre. The last couple of years Kennedy has chosen to limit his release schedule in order to prioritize his DJing, which he 2014 took global, checking continents such as Australia, South America and Asia of his gig bucket list. A lot of Kennedys time is spent running Hessle Audio, however, during 2014 he’s also lectured at Red Bull Music Acadimy Madrid and run, Acetate, a vinyl only club in Leeds. With remixes of Radiohead, The XX and M.I.A. the artist has taken the world by storm and he is a must see at Stay Out West 2014. \r\n\r\nBEN UFO\r\nBen Thomsom, aka Ben UFO, has distinguished himself as one of the only Brittish DJs having made a name for themselves without venturing into the world of production, something with says a lot of his performance and exceptional talent as a DJ. In the renown Resident Advisor poll for best DJ 2012 Ben UFO placed 21st guaranteeing him gigs at all the worlds best club venues. Ben UFO also runs his own radio show for the well-reputed UK station Rinse FM. His ability to mix old and new bangers while at the same time transcending genre boundaries and keeping true to his raw signature sound characterized by hard kicks, a reverberating bass and melodic strands motivates his current standing in the forefront of the UK dance music scene.'\r\n\r\nPANGEAE\r\nPangaea, or Keven McAuley, first tickled the ears of dubstep sympathizers back in 2007 with the release Coiled EP, on privately co-founded label Hessle Audio. It wasn’t until his next release, You &amp; I / Router, that Pangea proved himself a pioneer och trailblazer of the mutated garage-sound which, at the time, was very in vogue. This ability to currently place in the forefront of established genres (as well as up and coming ones), both with his own productions but also more generally with those of the Hessle label, he explains humbly: For me, production is all about doing your own thing in whichever way you want to do it…. I have zero technical advice to give”. \r\n\r\n \r\n","spotify_url":null,"youtube_url":"http://youtu.be/k-JAN4otgvU","wayoutwest_url":"http://wayoutwest.se/artist/hessle-audio?lang=en","artist_url":"http://hessleaudio.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/HessleAudio.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":44,"title":"Elliphant ","content":"You are probably already familiar with Ellinor Olovsdotter. She is the genius behind the catchy and immensely danceable Elliphant that dominated YouTube at one point. Ellinor is originally from Stockholm but began her career behind the mic at a Goa trance party before deciding to spend a summer in London, where she became instilled in the local dubstep scene. Elliphant seems to take inspiration from all of her experiences, which would explain why you could hear reggae, electro, dancehall, dubstep and a whole lot more in Elliphants songs.\r\n\r\nThe self-titled EP arrived in 2012 and was received with open arms by reviewers who were stunned that a Swedish girl was behind the record. When the full-length album ‘A Good Idea’ was released Elliphant found her music being taken into quite unexpected contexts, one of the tunes from her EP, ‘Tekkno Scene’ found its way onto FIFA ’13 for example. She was, shortly after, nominated for best newcomer at the Swedish P3 Guld music awards. She has built herself a reputation as a phenomenal stage performer, which has spread the world over, with a Gothenburg-based newspaper reporting that, “… not since Neneh Cherry’s break though have we heard a Swedish artist be so effortlessly cool,” and boy were they right. Ellinor Olovsdotter may be provocative, but she doesn’t care, not one little bit, and she does so in the hottest way possible, with a smile.\r\n\r\nThe bottom line is this is only the beginning, believe us, Elliphant will be around for years to come. It is obviously that she has much more to give. She is unique, driven and extremely musical. She is Elliphant.  \r\n","spotify_url":"http://open.spotify.com/artist/134GdR5tUtxJrf8cpsfpyY","youtube_url":"http://youtu.be/QTRGx6kv3ps","wayoutwest_url":"http://wayoutwest.se/artist/elliphant?lang=en","artist_url":"http://elliphant.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/elliphant2.jpg","favorites":11,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":45,"title":"Mapei","content":"With equal parts genuine American soul and R’n’B, combined with slightly chilled European club music, Mapei is the best of two worlds. Add to that some gospel and hip hop and you’ve got her recipe for success. But, when talking about Mapei, it dosen’t really matter. She moves freely across genres like you can’t even imagine, and that applies to all forms of her expression. Few artists possess such an ability to portray an emotion with their music as Mapei.  Everyone who’s heard the remarkable single ”Don’t Wait” knows that it gets right under the surface of your skin, and stays there.\r\n","spotify_url":"http://open.spotify.com/artist/6baWjwY7WiVPCZcW7pqqhz","youtube_url":"http://youtu.be/33mjGmfy7PA","wayoutwest_url":"http://wayoutwest.se/artist/mapei?lang=en","artist_url":"https://soundcloud.com/mapei","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Mapei_hemsida.jpg","favorites":6,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":46,"title":"Marissa Nadler","content":"Marissa Nadler could be the soundtrack of your dreams, but just as well that of your nightmares, depending on your state of mind when you dive into her work. She is a singer-songwriter, and talented at that, playing what is often referred to as ”dream-pop”. Back in February she released her sixth album in a decade ”July” - a breathlessly and abstemiously sung production with angelic but, at the same time, malicious harmonies taking you hypnotically into pop cosmos.  \r\n","spotify_url":"http://open.spotify.com/artist/5zjaF8JUdylMWrA7AVo3hJ","youtube_url":"http://youtu.be/BQ0zn6jqRdc","wayoutwest_url":"http://wayoutwest.se/artist/marissa-nadler?lang=en","artist_url":"http://www.marissanadler.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/marissaN_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":47,"title":"Highasakite","content":"Highasakite are from Oslo and have been widely celebrated for their driven but dreamy and melodic pop. The band consists of singer and song-writer Helene Håvik as well as Trond Bersu, Øystein Skar, Marte Eberson and Kristoffer Lo. Listening to Highasakite is like entering into a seance. Håvik raises her voice, calls upon spirits from times past and we all join together in the dance of the departed. The music of Highasakite is tambourines, claps, Indian drums, feathers and the feeling of sticking your head out the car window while driving full speed towards beach, saltwater, and waves. Highasakite is the summer you never want to end and the sea you never want to part with.\r\n","spotify_url":"http://open.spotify.com/artist/5awQWdBpLqN2KFVRN8w56T","youtube_url":"http://youtu.be/7pwTmu2-YGU","wayoutwest_url":"http://wayoutwest.se/artist/highasakite?lang=en","artist_url":"http://www.highasakite.no/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Highaskite_photo_TonjeTilesen_hemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":48,"title":"Samantha Crain","content":"When you see Samatha Crain for the first time you are stricken with the difficulty of determining her age, something which also holds true for her voice. Is Crain an old soul? That must be the case, because she is 27 years old, but could easily be mistaken for 10 years her junior, and has the voice of a women having experienced a lifetime of suffering. With four albums  to date she has a stable history to lean on. When her latest album ”Kid Face” was released in 2013, however, she somehow found the final piece of the puzzle. ”Kid Face” is a relatively moderate production where Crain’s extraordinarily expressive and grand, yet vulnerable voice is finally given the chance it has always been craving - to be the center of attention. \r\n","spotify_url":"http://open.spotify.com/artist/5dpLK5cD7FwWyDKv4qbodS","youtube_url":"http://youtu.be/GGVDTaDY3aI","wayoutwest_url":"http://wayoutwest.se/artist/samantha-crain?lang=en","artist_url":"http://samanthacrain.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/SamanthaCrain_hemsida_keisharegister.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":49,"title":"Katie Got Bandz","content":"A small but significant detail in rap-music is the so called “ad-lib”, all the little extra stuff rappers like to sprinkle around their verses. While some leave it at the occasional extra “yo” or supplementary moan, others have turned their ad-libs into personal brands. Take the “burrr!” of Gucci Mane, the monumental “RUH!” of Rick Ross or why not the disgusted “YUH” of Pusha T, scheduled to perform on this years Way Out West-festival. Chicago-rapper Katie Got Bandz approaches the ad-lib with the same directness as everything else she does; she simply says her name, “Katie”. But she does it in a way that is hard to resist and impossible to get out of your head once you've been exposed. “Katieeeeeeeeee!”\r\n\r\nKatie Got Bandz in one of the most interesting acts in the so-called Drill-scene, a dark, monotone form of hip hop that stems from the brand of aggressive trap-rap represented by Waka Flocka Flame. The popularity of Drill-rap has exploded in the last couple of years and seems to fill a void the hip hop-scene of the city previously has been unable to. While Chicago's most famous rapper, Kanye West, spent his first three albums processing his decision to drop out of college, the poor youth of his city is faced with existential problems of a far more direct kind. The lethal violence among Chicagos young is at levels so alarmingly high that some people refer to it as a war-zone, which has given the city the nick-name “Chiraq”. Drill-music is its soundtrack, and Katie Got Bandz is one of its most distinctive voices.\r\n\r\nKatie, who's cousin encouraged her to start rapping as a way to stay out of jail, has said that she uses music as a way to channel all her frustrations. But amongst the hardships there is also humour; Drill-music is directed at the club as well as the streets, meant to be used as a way to have fun in order to make it through. Katie Got Bandz makes her way through the darkness with a smile on her face, often surrounded by her friends. The biggest difference between her debut-song “I Need A Hitta” and her break-through hit “Pop Out” is basically her new haircut and increased budget. Her attitude and her battle-cry remain the same, and this summer the latter will be heard throughout the whole Way Out West festival: “KATIEEEEE!!!”\r\n","spotify_url":"http://open.spotify.com/artist/48ObYO3GM7R76nRcfyvnM9","youtube_url":"http://youtu.be/EFR8yVn8GSo","wayoutwest_url":"http://wayoutwest.se/artist/katie-got-bandz?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Katie_hemsida.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":50,"title":"Slowdive","content":"Sure, they did look at their feet a lot.\r\n\r\nSomewhere after 80’s had become 90’s, Slowdive manifested its introverted, dreamy and melodic indie music by consistently staring down at their feet whilst performing live. Feet staring turned out to be hot shit for an entire new league of proto-psychedelic indie bands, who subsequently grew fringes and built live shows based on eyeballing their shoes. A new genre was born, dubbed ’shoegazing’ by NME.\r\n\r\nBut there was more to shoegazing than shoes and feet. For groundbreakers Slowdive, and the genre as such, the flowing, effect laden soundscapes, often brittle harmonies and atmospheric moods was the essence. Alongside bands such as Ride and Swervedriver, Slowdive personified a sophisticated development of the british indie phenomenon, existing briefly in the borderland between the Madchester era and the chauvinistic britpop explosion that came with Blur and Oasis.\r\n\r\nSlowdive’s sophomre full ength, Souvlaki (1993) received musical input from none other than ambient guru Brian Eno, and went on the become the band’s breakthrough album of sorts. It was an authentic, immortal, archetypal milestone of an album, which encompassed more or less all the attributes in early 90’s indie which we used to love so much: the melodicism, the guitar-scapes, Creation records, not to mention bowl haircuts and curtain-like fringes. Ever since Slwodive called it quits in -95, we have mourned.\r\n\r\nUntil now.\r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/72X6FHxaShda0XeQw3vbeF","youtube_url":"http://youtu.be/F2YJbTrxeos","wayoutwest_url":"http://wayoutwest.se/artist/slowdive?lang=en","artist_url":"http://www.slowdiveofficial.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Slowdive_hemsida.jpg","favorites":6,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":51,"title":"Ry X","content":"Originating from Australia and now based in LA, RY X released the beautifully captivating four-track ‘Berlin EP’ in December through Infectious Music, home to artists such as alt-J, These New Puritans, Drenge and Local Natives. \r\n\r\nAt just under three minutes, lead track ‘Berlin’ is the definition of short and sweet. The song’s delicate guitar and emotive, echoing falsetto vocals draw you in so completely and feel so engulfing that it’s easy to forget this is simply one man’s voice and an acoustic guitar. The undulating feel of RY X’s voice is at times defeated and at others defiant, but it is this constant transition between serenity and catharsis that makes the EP so special.\r\n","spotify_url":"http://open.spotify.com/artist/2KjAo6wVc9d2WcxdxSArpV","youtube_url":"http://youtu.be/cFXN20bpWtY","wayoutwest_url":"http://wayoutwest.se/artist/ry-x?lang=en","artist_url":"http://www.ry-x.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Ryx_hemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":52,"title":"Zebra Katz","content":"Minimalism in rap is nothing new: It's already been twelve years since The Clipse dropped their break-through single “Grindin'”, which very well could be the most stripped-down hit record Pharrell Williams ever helped produce. In Sweden, no other rap-record has dominated the night-clubs during the last couple of years the way “Vafan Händz” has done, it's sound being the result of the rappers ordering super-producer Mack Beats to “stop adding stuff”. But it could very well be argued that “Ima Read” by New York-rapper Zebra Katz is the most uncompromisingly minimalist rap-single of all time. The song, made famous by fashion designer Rick Owens when he decided to use it as soundtrack to one of his shows in 2012, consists of three elements in total: The voices of Zebra Katz and guest Nenja Foxx and a dark, solitary, relentless bassdrum. The result is hypnotic, menacing, seductive and addictive: Azelia Banks, Gangsta Boo, Tricky and Busta Rhymes are among the rappers unable to resist the urge to drop their own verses over the instrumental, and the song itself has been remixed so many times that Katz himself stopped counting at 78.\r\n\r\nAs a rapper Zebra Katz is doing genuinely new things in ways that is deeply rooted within rap-tradition: In the same way that rappers always have been introducing words and phrases to audiences sometimes far removed from the context from which they originated, Zebra Katz is exposing masses of people to specifically non-white and non-straight slang. And he doesn't really care if they “get it” or not. This uncompromising attitude is apparent in everything Katz does, as well as the threatening, scary yet playful aesthetic that shape his videos, from the horror movie-esque girls in masks from the “Ima Read”-video to the effective and deeply un-comforting use of standard Photo-booth-effects in the new video for “Last Name Katz”. On the latter Katz mixes, over one of his more “rap-y” productions, standard hip hop-phrases about rolling blunts and pouring drinks with the description of his preferred way of greeting; “A kiss on the cheek, a pat and a hug”. This is the hip hop-handshake of a new type of rapper, for whom fashion is much more than pair of extra-expensive Nikes.\r\n\r\nBut regardless of what labels you'd like to pin on Zebra Katz and what he does, it is undeniably club-music we are dealing with here. In a time when “electronic dance music” is dominated by white straight men making music for well-adjusted teenagers to make out and spend money to, Zebra Katz reminds us of the nights when “the club” was an unsettling, decadent and risky place. That he visits Sweden during the Way Out West festival fits with the rhythm of the Swedish year: The club will be as hot as the late-summer sun, and in August the night is still warm. But when the lights come on and it's time to hobble up out of the club you will feel that the season has turned. You won't have to go home, the night will still be dark.\r\n","spotify_url":"http://open.spotify.com/artist/5Tz4zMiRWqiQVAymWZz99a","youtube_url":"http://youtu.be/oo4Sqt2Bmag","wayoutwest_url":"http://wayoutwest.se/artist/zebra-katz?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/ZEBRA_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":53,"title":"I Am Legion [Noisia x Foreign beggars] ","content":"Drum n Bass giants Noisia and the prodigious British grime/rap collective Foreign Beggars decided to start working together on a concept album that would bring their two musical worlds colliding. The result was the band I Am Legion and the self-titled album, released last year on Noisia’s record label, Division. On the record they decided to do whatever they wanted to do, and not what people were expecting them to do, and boy are we glad they did. I Am Legion have been labelled a supergoup, and if you throw together their musical catalogues, you end up with a collection of upwards of 100 albums, Ep’s and singles, making that supergroup label pretty hard to argue with.\r\n\r\nIf there is something these guys do damn well, its to create music with a seamless fusion between bass and grime that results in a heavy, energetic, dark sound that is hard to resist, it gives you the best of two musical worlds. I Am Legion are known to take their live shows pretty seriously, if you go to their shows, you know you won’t be leaving without getting completely immersed. \r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/2wNMk7BiCiuO7hjGZPZYuJ","youtube_url":"http://youtu.be/199TISojIgw","wayoutwest_url":"http://wayoutwest.se/artist/i-am-legion?lang=en","artist_url":"https://soundcloud.com/iamlegionmusic","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/iamlegion_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":54,"title":"Amen Dunes","content":"Behind the name Amen Dunes, you’ll find Brooklyn based musician Damon McMahon, whose first release back in 2009 titled ‘DIA’ showcased a personal kind of lo-fi rock that was, well, superb. Since then he has managed to release two full-length albums, with last years, ‘Spoiler’ the most recent, which along with various Ep’s and singles have allowed Amen Dunes to consolidate its wayward sound. The fourth album, ‘Love’ is due in May on Sacred Bones Records, from which two singles have been released and from what we have heard so far, its going to be pretty awesome. The latest single, ‘Lilac in Hand’ which premiered on the noted music site ‘The Father’ showed folk rock taking a bigger role in the sound, in McMahon’s own enchanting way.\r\n","spotify_url":"http://open.spotify.com/artist/1jwOuEBcOKq0BeudSarbEM","youtube_url":"http://youtu.be/hDWlFYlasNk","wayoutwest_url":"http://wayoutwest.se/artist/amen-dunes?lang=en","artist_url":"https://www.facebook.com/pages/Amen-Dunes/226703240696221","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/AmenDuneshemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":55,"title":"Kelela","content":"When Kelela released her debut-mix last year, on the Fade To Mind record label, we found it pretty damn hard to stay in our seats. She is the perfect bridge between RnB, modern dance music and club culture. She has, since then, become an integral part of Fade To Mind and the London collective Night Slugs, as she explores the bordering roles of being a producer, vocalist and Dj. This in turn has led to her beautiful and evocative voice being heard on several other producers and artists tracks, such as Kingdom, Bok Bok and Teengirl Fantasy.\r\n\r\nThis year Kelela performed at SXSW and with her friends from Fade To Mind and Night Slugs, she has played the world over, including the legendary Boiler Room. She now has a rumoured, eagerly awaited debut album in the pipeline, which must be sweet confirmation for Annie Mac of BBC Radio 1 that had Kelela on the ‘one-to-watch’ for 2014 list.\r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/1U0sIzpRtDkvu1hXXzxh60","youtube_url":"http://youtu.be/7rap0mltYlk","wayoutwest_url":"http://wayoutwest.se/artist/kelela?lang=en","artist_url":"https://soundcloud.com/kelelam","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Kelela_hemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":56,"title":"Conor Oberst","content":"Once upon a time, Conor Oberst was a wunder-kind. When Bright Eyes, the seminal folk-rock-pop-whatever sensation Oberst nurtured with eternal bandmates Mike Mogis and Nate Walcott, shook both critis and music afficionados in the beginning of the 2000’s, everyone marvelled at the boy’s creativity and masteful songwriting abilities. Since the ripe age of 15, Oberst had chiselled unique, sometimes sombre folk-esque indie that struck a chord with both drunken critics, pop kids and music snobs. Bright Eyes released one hype after the other, and suddenly 15 years had passed and Conor had become a wunder…adult.\r\n\r\nHe might be slightly older now, but Conor Oberst’s musical talent and inexcplicable inguenity remains newborn. Not neccessarily as an instrumentalist, perhaps not as a vocalist, but his sense of lyricism and melody is most definitely something which sets him aside – and makes him productive. One outlet is not enough for Conor Oberst, these days he creates wonders in no less than five different constallations! Swedes will produly note that Oberst also produced folk icons First Aid Kit’s latest album, while the sisters Söderberg returned the favor in the form of guest harmonies on Oberst’s upcoming manifesto ”Upside down mountain”.\r\n\r\nOh yeah, that album. Conor Oberst has delivered as many different varieties of musical expression as he has albums, but when ”Upside down mountain” arrives in May 2014, it marks the return to something its authour describes as more intimate and personal. At Way Out West 2014, however, you need not concern yourself with such analysis. Conor Oberst will sweep you off your feet nonetheless.\r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/2Z7gV3uEh1ckIaBzTUCE6R","youtube_url":"http://youtu.be/LpyNydatVwQ","wayoutwest_url":"http://wayoutwest.se/artist/conor-oberst?lang=en","artist_url":"http://www.conoroberst.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/ConorOberst_hemsida.jpg","favorites":4,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":57,"title":"The Growlers","content":"This is not another Norwegian metal act right here, oh no this quintet from the bright lights of California, are a margarita scented (we mean the drink AND the pizza) Hunter. S. Thompson sunrises, sunshine mix of surf and garage rock. It’s Beach Goth.\r\n\r\nThe band made quite an impact when they toured Sweden last year with the album, ‘ Hung at Heart.’ If you were there, we look forward to meeting again. Those of you who couldn't make it though, will finally get the chance.  The album was, in fact, first produced by Dan Auberbach of Black Keys fame, but was swiftly binned by the band who decided to record everything themselves instead, and my aren’t we glad they did.\r\n\r\nBetween then and now, the band has also released the sequel, or perhaps little brother to, ‘Hung at Heart,’ which they titled, ‘Gilded Pleasures.’ If it is anything like its predecessor it will be like Christmas come early for all us Growler-saved souls. On a side note, the band has a grand total of 0 mentions on Pitchfork, surely that has to be seen as some kind of achievement? Either way, we will see you in the reverb-drenched night. Right at the front, and perhaps, just perhaps in the company of Bill Murray.\r\n","spotify_url":"http://open.spotify.com/artist/2RhgnQNC74QoBlaUvT4MEe","youtube_url":"http://youtu.be/oukEcOFYV1Y","wayoutwest_url":"http://wayoutwest.se/artist/glowlers?lang=en","artist_url":"http://www.thegrowlers.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/growlershemsida.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":58,"title":"Real Estate","content":"New Jersey quintet Real Estate is undoubtedly one of the past few year’s most critically lauded acts with their melodious take on indie pop. After releasing their self-titled debut album on Brooklyn label Woodsist back in 2009 the band signed with Domino Records ahead of the release the brilliant “Days” in 2011, and its follow-up “Atlas”. “Atlas” was met with rave reviews at its release in March this year and it opens up a new side of the band as their sun-drenched beach pop has taken on a slightly more solemn shade.\r\n\r\nWith a sound made for the festival summer and three critically acclaimed records – and a whole bunch of imitators clutching at their heels – Real Estate is one of the most interesting acts of the American indie pop scene (especially if we’re including their numerous side projects, like Ducktails and Alex Bleeker and the Freaks). With Real Estate returning to Sweden for the first time since 2011 there’s not much to do but anxiously await their arrival.\r\n","spotify_url":"http://open.spotify.com/artist/41SQP16hv1TioVYqdckmxT","youtube_url":"http://youtu.be/MgsdblVq8wo","wayoutwest_url":"http://wayoutwest.se/artist/real-estate?lang=en","artist_url":"http://www.realestatetheband.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/realestate.jpg","favorites":3,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":59,"title":"Speedy Ortiz","content":"Speedy Ortiz originally started out as the solo project of the guitarist, vocalist and songwriter Sadie Dupuis in 2011 but quickly evolved into a full band, before taking off. The quartet signed with Carpark Records (Cloud Nothings, Beach House etc.) ahead of the release of their debut album “Major Arcana”, which arrived to glowing reviews last year. The band followed it with equally praised EP “Real Hair” in February this year – 13 minutes of completely brilliant indie rock.\r\n\r\nInfluenced by legends of the genre like Dinosaur Jr., Sonic Youth, The Breeders and Slint, Speedy Ortiz has appeared as one of the most exciting indie rock acts of the moment. Dupuis clever lyricism is accompanied by guitar-heavy lo-fi indie, with immediate melodies and a clear sense of urgency and purpose. After a successful first visit to Europe earlier this year it’s finally time for Speedy Ortiz to make their first appearance in Sweden – and naturally it’ll be as part of Stay Out West.\r\n","spotify_url":"http://open.spotify.com/artist/6YHfq8Pg3lZPo1u0PaQ8ob","youtube_url":"http://youtu.be/-V3hM-YDsOk","wayoutwest_url":"http://wayoutwest.se/artist/speedy-ortiz?lang=en","artist_url":"http://speedyortiz.bandcamp.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/SpeedyOrtizhemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":60,"title":"Emilie Nicolas","content":"Norwegian pop artist Emilie Nicolas have gone from being a regular student to one the most interesting new pop acts in Scandinavia in just a year. She made her way into the A-lists of Norwegian radio with a cover of Norwegian indie rock band DumDum Boys’ “Pstereo”, a track she completely turned into her own, as well as performed at the Norwegian P3 Gull-gala last year. At the by:Larm festival earlier this year British online tastemakers The Line of Best Fit named Nicolas as one of the festival’s highlights, earning a place among acts like Tove Lo and Naomi Pilgrim.\r\n\r\nDespite having only released three tracks, including the “Pstereo” cover, Emilie Nicolas have established herself as Norway’s next rising star with international blogs and sites already paying close attention to her progress. Emilie Nicolas is currently working on her debut album, due later this year, and with a sound reminiscent of both MØ and Tove Lo, as well as Lykke Li, and a mesmerizing voice Emilie Nicolas is certainly one to watch.\r\n","spotify_url":"http://open.spotify.com/artist/4cXE1g28uYrIaUisUx5cJt","youtube_url":"http://youtu.be/xJN_0Ea0P0E","wayoutwest_url":"http://wayoutwest.se/artist/emilie-nicolas ?lang=en","artist_url":"https://soundcloud.com/emilienicolas","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/emilienicolashemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":61,"title":"Naomi Pilgrim","content":"After spending time as a backing vocalist with Lykke Li Swedish-Barbadian Naomi Pilgrim released her debut single “No Gun” last fall and the single quickly became one of the most blogged about tracks in the world. “No Gun” was praised for its unique mix of pop, soul and r’n’b and Pilgrim was instantly hailed as Sweden’s next pop star in the making, a title she wears comfortably.\r\n\r\nFollowing glowing reviews on influential sites like Pigeons &amp; Planes, Dazed &amp; Confused and The Line of Best Fit Pilgrim released her self-titled debut EP in February this year, and her debut album is currently in the works. With one foot in Swedish electronic pop and the other in modern urban r’n’b it is surely only the beginning of a long and successful career, and Naomi Pilgrim is already one of Sweden’s brightest shining new acts.\r\n","spotify_url":"http://open.spotify.com/artist/5QpXKWRjxAVZlmn5trAa16","youtube_url":"http://youtu.be/d-lzA09FR0I","wayoutwest_url":"http://wayoutwest.se/artist/naomi-pilgrim?lang=en","artist_url":"http://www.naomipilgrim.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Naomi-pilgrimPress-hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":62,"title":"Agent Orange","content":"Agent Orange is the band that first combined punk with surf rock way back when, in the 1970s. In doing so they created a new and uniquely energetic sound, coming straight out of Orange County, California. This was an area that has generally always been characterized by the punk scene, but when the hardcore scene was at its peak, in stepped Agent Orange with their sound that was just as hard and frenetic but with an aesthetic inspired by the Beach Boys.\r\n\r\nThe bands first single ‘Bloodstain’ from the 7”EP quickly became a popular radio play and went on to attract the attention of Tony Hawk to be featured on Tony Hawk’s Pro Skater 4. Their first record was released on Posh Boy Records in 1981 and soon after the band was named as one of the best punk bands in Southern California.\r\n\r\nFast forward by 30 years and the band have just released their latest single, with Agent Orange still delivering their very own take on punk with that additional influence that Mike Palm once helped to create. Now made-up of Mike Palm, Perry Giordano and Dave Klein this is a sound that could make skateboards roll all on their own, an awesome mix between Dick Dale and Minor Threat. Don’t miss them at Stay Out West. \r\n","spotify_url":"http://open.spotify.com/artist/1pBsvSnrhmgDZqisT13SFA","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/agent-orange?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/agentorange.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":63,"title":"Mutual Benefit","content":"Mutual Benefit is the creative cascade of 25-year-old Jordan Lee, a gifted musician with a transient disposition to his abode, constantly on the move, from Ohio to Austin and most recently to Brooklyn. During his time in Brooklyn he has run the ‘Kasette Klub’, but also formed Mutual Benefit, something of a mix between a solo project and a structure-less musical collective.\r\n\r\nAfter a smattering of EP’s and singles, the first full length offering, ‘Love’s Crushing Diamond’, brings their woozy, off-kilter indie-pop to a burgeoning fan base. Originally set to be a cassette-only self release, it was only when some friends of theirs offered to start a label and press a limited edition run that they changed their minds, a Bandcamp posting followed, which led to the first ever Bandcamp posting to be named as ‘Best New Music’ by Pitchfork and a ‘Band to Watch’ accolade from Stereogum.\r\n\r\nThe Mutual Benefit sound is a mix of hi- and lo-fi techniques, with a line-up consisting of keyboards, guitar, violin and banjo, plus assorted DIY percussion and found sounds. Songs explore the highs and lows of the human condition, they are thick, but not dense and you can feel yourself being nuzzled by Lee’s lightly enunciated vocals. \r\n","spotify_url":"http://open.spotify.com/artist/0AUwa5xmiy57qdGlOksvea","youtube_url":"http://youtu.be/dlQlokP7IjQ","wayoutwest_url":"http://wayoutwest.se/artist/mutual-benefit?lang=en","artist_url":"http://mutualbenefit.bandcamp.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/mutualbenefithemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":64,"title":"Mendoza","content":"","spotify_url":null,"youtube_url":"http://youtu.be/m8i50l9xhtA","wayoutwest_url":"http://wayoutwest.se/artist/mendoza?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Mendoza.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":65,"title":"D.O.A","content":"The year was 1978, three guys from Vancouver, Canada decided to start a band and in doing so they would lay the foundations for what was to later become hardcore punk. Since then they have become legends, having released a total of 18 studio albums, they have used their music to stand up to injustice around the world. They are the one and only  D.O.A\r\n\r\nWhen Joey ‘Shithead’ Keithley – a legal student with a focus on human rights - Chuck Biscuits and Randy Rampage started a band in 1978, they would have no idea that they would basically become the founding fathers of hardcore punk. Over the years the band may have changed its line-up more than once, the names that have been involved at some stage or another makes a pretty awe-inspiring list, now the only original band member is Keithley. Keithley has never shied away from his human rights interest, which have become a staple element of the bands work; evident in the bands lyrics, involvement in human rights campaigns and their slogan, ‘Talk Minus Action Equals Zero’. This makes Keithley’s choice to stand for NDP nomination in Coquilam-Burke Mountain in 2012 unsurprising, although it resulted in the decision for the band to begin their farewell tour in January of last year – evidently this is still going on as the band are continuing to play concerts around the world - proving that punk guys always come back to the fans. \r\n\r\nWe can’t wait for the show; packed with memorable punk tunes, inspiring lyrics and showmanship at its hardcore best. Let go of your inhibitions and remember, ‘talk - action = 0.’\r\n\r\n\"The big thing to remember is that we can, we will and we must make this world into a better place. \"\r\n\r\n - Joey Keithley\r\n","spotify_url":"http://open.spotify.com/artist/3g92p1YpivbOqVLiYVd4Yk","youtube_url":"http://youtu.be/m38EdJeM6dU","wayoutwest_url":"http://wayoutwest.se/artist/doa?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/deep_wave_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":66,"title":"Rebecca &amp; Fiona ","content":"Rebecca and Fiona are the Swedish pop Dj/vocalist duo from Stockholm that rose to fame in 2010 with their first single, the insanely catchy and danceable, ‘Luminary Ones.’ Having met through mutual friends, the girls who were already pretty settled into the local DJ scene, immediately bonded over love, life and music and began to create music of their own. After the success of their first single and their very own reality show, they spent most of 2011 touring extensively, trekking around the U.S, Asia, Australia and Europe alongside artists such as Tiesto and Kaskade. In 2012 they released their debut album ‘I Love You, Man’ and the duo have just returned with the release of their new track ‘Candy Love’. The track is out now via Ultra Records is the first single from their upcoming album ‘Beauty Is Pain’, due out this April.\r\n\r\nThe have even been inspiring other girls to get involved in Dj-ing, after paving the way in their native Sweden, where female DJs represent half of all electronic music performers, they have been coaching young girls at DJ schools thrown by Adidas.\r\n\r\nThese two really know how to create soaring, infectious, hook-laden tracks and are sure to get the crowds dancing; the perfect soundtrack to summer.\r\n","spotify_url":"http://open.spotify.com/artist/6rgEPiKjowlMKZC1DF6W75","youtube_url":"http://youtu.be/wdMFpcVtCTw","wayoutwest_url":"http://wayoutwest.se/artist/rebecca-och-fiona?lang=en","artist_url":"http://www.rebeccafiona.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/r-f.jpg","favorites":9,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":67,"title":"Seasick Steve","content":"","spotify_url":"http://open.spotify.com/artist/6OVkHZQP8QoBYqr1ejCGDv","youtube_url":"http://youtu.be/tPzlYsaJyKI","wayoutwest_url":"http://wayoutwest.se/artist/seasick-steve?lang=en","artist_url":"http://www.seasicksteve.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/SeasickSteve.jpg","favorites":5,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":68,"title":"Linda Pira – Ladies First","content":"Ladies First is a hip-hop concert showcasing the new wave of female rappers, with Linda Pira at the helm. The concert build upon the song, ‘Knäpper Mina Fingrar’ (Snap My Fingers) Remix and on stage we will see Linda Pira together with Kumba, Rosh, Cleo, Sep, Vanessa Falk, Rawda, Julia Spada and Joy. Stor and Dani M will also be involved with Dj Salla from Redline Records backing them up.\r\n\r\nThe concert is organised in collaboration with Redline Records, a record company founded in 1996 that has become a red thread weaving its way through Swedish hip-hop - from the Latin Kings to Linda Pira.\r\n\r\nLinda Pira herself released her acclaimed debut EP ‘Matriarch’ in 2013 and won a Swedish Grammis prize in 2014 for Best Newcomer.\r\n","spotify_url":"http://open.spotify.com/artist/0qeei9KQnptjwb8MgkqEoy","youtube_url":"http://youtu.be/CloPMxoqWeA","wayoutwest_url":"http://wayoutwest.se/artist/linda-pira-ladies-first?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/lindapirahemsida.jpg","favorites":5,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":69,"title":"Poliça","content":"Minneapolis fortsätter att producera häpnadsväckande talanger, vi talar om den psykedeliska R&amp;B och pop-soul outfiten Poliça. Producerat av Ryan Olson och frontat av sångerskan Channy Leanagh vars kraftigt förvrängda sång sträcker sig över drömska atmosfärer. \r\n\r\nEfter att ha samarbetat med bandet Gayngs under 2010, var det uppenbart att Channy och Ryan skulle bilda en egen grupp. Ryans popkänslor och elektroniska äventyrspolitik skulle visa sig vara det perfekta fordonet för Channys tillväxt och utveckling som vokalist och dynamisk experimentalist. I juni 2011 började de skriva ihop vad som skulle bli Poliças debutalbum, \"Give You The Ghost\". Ett album som genererade i Justin Vernots (grundare av Bon Iver) uttalande \"Det är det bästa bandet jag någonsin hört\".\r\n\r\nNamnet Poliça hänvisar till ordet \" politik\", en bestämd handlingslinje som antagits till förmån för opportunism, vilket tyder på att de bildades av nödvändighet. Vilket är exakt hur Poliça känns och låter, brådskande, originellt och genre-utmanande, Poliça är absolut nödvändiga.\r\n","spotify_url":"http://open.spotify.com/artist/34vLhockmYhf3LgznwyNaQ","youtube_url":"http://youtu.be/yX4iIPlwS5c","wayoutwest_url":"http://wayoutwest.se/artist/polica?lang=en","artist_url":"http://thisispolica.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/policahemsida.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":70,"title":"Neko Case","content":"There are those artists that we simply cannot fathom why more people aren’t listening to them. Neko Case is just one of those artists. Over the last 20 years the forty-year-old Canadian has enveloped the north American indie scene, with one foot firmly rooted in the indie super group The New Pornographers, and the other in a solo career that has earnt her a prominent place in the American alt-country scene.\r\n\r\nBut to describe Neko Case simply as a country artist is a tad lackadaisical, sure you could maybe describe her as a Dixie Chicks-ified Feist, but behind that Americana façade is a multifaceted storyteller. She is an incredibly gifted artist with the voice of a siren, telling fictional, quirky stories, each one a screenplay in the making.\r\n\r\nOn her last album ‘The Worse Things Get, The Harder I Fight, The Harder I Fight, The More I Love You,’ however, she turned the spotlight on herself. After a deep depression caused by the passing of several close family members, her music and the album became her solace. The album is not only a personal exorcism, but also a musical step-forward for Neko, who smoothly crosses musical genres, from power pop to stripped down a cappella. Infact the a cappella-esque, ‘Nearly Midnight, Honolulu’ is all you need to hear to understand her as an artist, that distinctive voice and timeless storytelling will be what makes her immortal. Perhaps in 25 years we will be archiving Neko Case next to likes of Joan Baez and Joni Mitchell. \r\n","spotify_url":"http://open.spotify.com/artist/4Cedjq5BQL3MhapRvDpFED","youtube_url":"http://youtu.be/gCV-YMD6oXA","wayoutwest_url":"http://wayoutwest.se/artist/neko-case?lang=en","artist_url":"http://nekocase.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/nekocasehemsida.jpg","favorites":5,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":71,"title":"Neneh Cherry w/ RocketNumberNine","content":"We want Way Out West to be like Neneh Cherry.\r\n\r\nThe ideas that permeated the design of our August extravaganza in Slottskogen is a reflection of everything that made Neneh Cherry one of Sweden’s first pop-culture icons; loyalty, pop music, social pathos, hip hop, emotional sincerity and with a charisma so powerful it’s almost electric.\r\n\r\n‘Blank Project’ is Neneh Cherry’s magnificent comeback album after almost two decades away from the scene. It may come from a place of sorrow - her mother’s passing – but the lady herself is in fantastic form. Along with the electronica producer Kieran Hebden (aka Four Tet) she has turned that loss into something musically experimental. Her power card, that wonderful voice still take centre stage, but the songs are sometimes stripped back and hypnotic, sometimes hard hitting and evocative. ‘Out of Black’ her single in collaboration with her artistic younger sister Robyn, stirs us in the same way that she stirred us back in 1989 with her mainstream breakthrough, ‘Raw Like Sushi’.\r\n\r\nWhile the wall fell and freedom became a human motivation rather than a marketing slogan, Neneh Cherry broke musical, political and stylistic norms – decades ahead of her time. Tracks like ‘ Buffalo Stance’ and ‘Manchild’ were not only immortal hits, but also turned club culture into an instrument of anti-racism and feminism. Her songs are proof that truly inspiring artistry flows from the soul and never goes away.\r\n","spotify_url":"http://open.spotify.com/artist/3JxCEqL9zjKnDJgUhRuRJD","youtube_url":"http://youtu.be/JWsRz3TJDEY","wayoutwest_url":"http://wayoutwest.se/artist/neneh-cherry?lang=en","artist_url":"http://nenehcherry.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/nenehcherryhemsida.jpg","favorites":8,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":72,"title":"20 000 Days on Earth","content":"Swedish Premiere\r\nDocumentary, UK 2014\r\nDirected:  Iain Forsyth, Jane Pollard\r\nStarring: Nick Cave, Blixa Bargeld, Kylie Minogue\r\nSundance 2014, Berlin 2014\r\n\r\nAn incredibly ambitious documentary based around 24 hours in the life of artist and icon Nick Cave. The film moves slickly between topics such as the creative process, our collective sense of identity and the transformative power of art and music. \r\n\r\nPress:\r\n“Incredible. Puts most music films to shame. So inventive and inspiring.” Dave Calhoun, Time Out\r\n\r\n“Staged, stylized and weird as fuck, it's the rare rock film that raises more questions than lighters” Logan Hill, RollingStone.com\r\n\r\n“The most sophisticated rock star biog ever…beautifully shot..in one visually explosive sequence, he waxes lyrical about the time he met his wife Susie Bick… a powerful moment in a remarkable film.” Nick James, Sight and Sound\r\n\r\n“Simply astounding, razor sharp, dynamic” Rob Nelson, Variety\r\n\r\n“Probably best music doc I've ever seen… so much more than music. Beautifully made” Wendy Mitchell, Screen International\r\n","spotify_url":"http://open.spotify.com/artist/1RM5gp0RFfjpJhCYFPB30p","youtube_url":"http://youtu.be/kV9cobZP4JA","wayoutwest_url":"http://wayoutwest.se/artist/20000-days-on-earth?lang=en","artist_url":"http://www.20000daysonearth.com","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/20000daysonearth-2.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":73,"title":"Boyhood","content":"Swedish Premiere\r\nFiction, United States 2014\r\nDirector: Richard Linklater\r\nStarring: Ethan Hawke, Ellar Coltrane, Patricia Arquette, Lorelei Linklater\r\nWinner Berlin Film Festival 2014, Winner SXSW 2014: \"Louis Black / Lone Star Award\"\r\n\r\nRichard Linklater's “Boyhood” is like nothing you've ever seen before.\r\n\r\nOr, of course you have in some way, we all have. You just have to take a look at your own family and realise that is happens everywhere. People screw up and people do good. They grow hipster beards and fall in love and there is no solution but to continue moving forward, quickly.\r\n\r\nLike a modern and cinematic Book of Kells, we scroll through the illuminated pages. For 12 years we follow Mason’s journey through divorce, voices that break and hearts that burst, in a crumbling adult world.\r\n","spotify_url":null,"youtube_url":"http://youtu.be/-Mhjhsg9ylk","wayoutwest_url":"http://wayoutwest.se/artist/boyhood?lang=en","artist_url":"http://www.boyhoodmovie.com","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Boyhood_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":74,"title":"Homesick - (Although I no longer know where home is)","content":"Documentary, Sweden / Finland 2014\r\nDirector: Alexandra Lind\r\nStarring: Eero Mäntyranta, Pär Viktor Fors Mäntyranta\r\nMusic: Surunmaa\r\n\r\nA stubborn old man with crooked fingers lives with his reindeer in Finland’s deepest forest.\r\nA heartbroken granddaughter returns home to Gothenburg to seek answers about her grandfather’s history and life choices.\r\n\r\nThis is a story about being homesick, even though you may no longer know where home is. About longing for something to be real. About finding something of substance in modern life than can at times seem pointless.\r\n\r\nThis film about a Finish national hero and his grandchild has been seen by over 800,000 people in Finland.\r\n","spotify_url":null,"youtube_url":"http://youtu.be/YPulB_7xRds","wayoutwest_url":"http://wayoutwest.se/artist/homesick?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/homesick_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":75,"title":"Gruppen och Herrarna!","content":"World Premiere\r\nDocumentary, Sweden 2014\r\nDirector: Mia Thermaenius\r\nStarring: Bianca Kronlöf, Nina Haber, Elin Söderquist\r\n\r\nThis is a film about man and masculinity.\r\nHow can it be that a group that is so privileged can be, at the same time, so afflicted? It is a montage with a rebellious tone about political discourse, documentary work and filmed performing arts.\r\n\r\nOriginally a performance by the theatre group, the film is a musical and humorous drama that explores man and masculinity.\r\n\r\nThey want to talk about manhood and it is urgent. Masculinity is deadlier than any other poison or drug.\r\n\r\nConsisting of Nina Haber, Bianca Kronlöf and Elin Söderquist, the film is based upon facts and from these a script was born that came to life through choreography, music and humour. \r\n","spotify_url":null,"youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/gruppen-och-herrarna?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Gruppen_1.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":76,"title":"All We Have Is Now","content":"World Premiere\r\nDocumentary, Sweden 2014\r\nDirector: Alexandra Dahlström\r\nStarring: Cissi Efraimsson, Lisa Pyk Wirström, Rebekah Rolfart\r\n\r\nThe punk band Vulkano are ready to take over the world. As their journey begins, we meet the three girls in a basement in Skanstull, made up of past members of the Swedish band ‘Those Dancing Days’ Cecilia Efraimsson, Lisa Pyk Wirström, and Rebekah Rolfart. However, before their big trip to Los Angeles to play for some important contacts in the American entertainment industry, Rebekah jumps ship.\r\n\r\nWinner of the Swedish Guldbagge award, actress Alexandra Dahlström makes her directorial debut with an intimate documentary on how to start a punk band in the 2010’s that is big on heart. Produced by Göran Hugo Olsson (The Black Power Mixtape, Concerning Violence among others) and Story (At night I fly, Belleville Baby among others). \r\n","spotify_url":null,"youtube_url":"http://youtu.be/ILmppFIMPIY","wayoutwest_url":"http://wayoutwest.se/artist/all-we-have-is-now?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/allwehave.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":77,"title":"The Punk Singer","content":"Documentary, USA 2013 \r\nDirected by Sini Anderson\r\nCast: Kathleen Hanna, Adam Horowitz, Joan Jett, Kim Gordon, Johanna Fateman, JD Samson.\r\n\r\nIf feminism had been a church, Kathleen Hanna would hang in it as the undisputed icon of the 90s. As a true rrriotgirl, she wrote songs about welfare, class struggles and women’s rights and wondered what the hell was it with John Cassavettes?\r\n\r\nBeside being the heroine of Western feminism, she is also one of the most prominent riot-grrrls and has played in some of the toughest and most radical punks groups that have existed: Bikini Kill, Le Tigre and Julie Ruin.\r\n\r\nThe film is a revealing and intimate celebration of Hanna’s music and her fight against sexism, musical conformity and her own illness.\r\n\r\nKathleen Hanna is also performing at Way Out West 2014 with her latest project The Julie Ruin.\r\n\r\nPress:\r\n\r\n\"A concise look at Hanna as a larger-than-life force and her more up-close, human travails.\"\r\n—Mark Olsen, Los Angeles Times\r\n\r\n\"Beautiful and rousing!\"\r\n—Karen Valby, Entertainment Weekly\r\n\r\n\"For those of us who were raised on Bikini Kill, Fugazi and fan zines—this is essential viewing.\"\r\n—Scott Beggs, Film School Rejects\r\n","spotify_url":"http://open.spotify.com/artist/3jCDV35GjiUGWYWKgMd9CF","youtube_url":"http://youtu.be/zMbLzaVkn2s","wayoutwest_url":"http://wayoutwest.se/artist/the-punk-singer?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/punksinger.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":78,"title":"Mistaken for Strangers","content":"Documentary, USA 2013\r\nDirector: Tom Berninger\r\nStarring: Tom Berninger, Matt Berninger, Bryce Dessner, Aaron Dessner, Bryan Devendorf, Scott Devendorf\r\nMusic: The National\r\n\r\nMatt, the lead singer of the band The National, finally gets the success he has dreamed of, while his younger brother Tom, a loveable rogue and hard rocker still lives with his mum. As any good brother would, Matt wants to try to help Tom out and asks him if he wants to work as a roadie on The Nationals biggest tour.\r\n\r\nTom has other plans however and what starts out as an ordinary rock documentary unfolds into a surprisingly honest portrait of two brothers and the frustration of unfulfilled creative ambition. \r\n","spotify_url":"http://open.spotify.com/artist/2cCUtGK9sDU2EoElnk0GNB","youtube_url":"http://youtu.be/7ENUKnJB_6k","wayoutwest_url":"http://wayoutwest.se/artist/mistaken-for-strangers?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/mistaken-for-strangers-web.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":79,"title":"Off The Beaten Track","content":"Swedish Premiere\r\nDocumentary, Portugal / UK, 2013\r\nDirected by João Pedro Moreira\r\nStarring: Buraka Som Sistema\r\nMusic: Buraka Som Sistema\r\n\r\nThe film follows four unlikely musicians on their journey, over the last year, to Luanda, Caracas, Paris, India, London and the Lisbon suburb of Amador to show how these cities, the sounds, colours and movements, created the phenomenon that is Buraka Som Sistema.\r\n\r\nThe film, directed by João Pedro Moreira, collects all of the elements that make Burakas story so unique and with the help of never-before-seen images creates a wonderfully wild ride. This is an insider’s view of life inside one of the most colourful and innovative groups right now. \r\n","spotify_url":"http://open.spotify.com/artist/6zUiRChNyL3HEezOd1Wjam","youtube_url":"http://youtu.be/u5vAINF-D5Q","wayoutwest_url":"http://wayoutwest.se/artist/off-the-beaten-track?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/offthebeaten.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":80,"title":"Bloody Beans","content":"","spotify_url":null,"youtube_url":"http://youtu.be/MAThje73G18","wayoutwest_url":"http://wayoutwest.se/artist/bloody-beans?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/bloodybeans_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":81,"title":"Concerning Violence","content":"Documentary, Sweden 2014, 90 min\r\nDirector: Göran Hugo Olsson\r\nProducers: Annika Rogell, Tobias Janson\r\n\r\nGöran Hugo Olsson is a guest of honour at Way Out West. In 2012 he and Adam Tensta created an outstandingly powerful performance for Way Out West, in which Adam had created music for a specially cut version of “Black Power Mixtape”, a movie on black liberation in the US during the 1960/70s based on imagery from Swedish television archives.\r\n\r\nNow he is back at Way out West with an equally powerful film, “Concerning Violence” is a bold and visually astounding story based on newly discovered archival material from the most daring moments in the struggle for liberation from colonial oppression in Africa. These fantastic images and scenes from Swedish television archives combined with text from Frantz Fanon 's classic book \" Cursed Earth \" that was written in 1960 but is still important today as a tool for understanding how colonialism works, as well as the turmoil and violent unrest against it.\r\n\r\n\"Colonialism is not a thinking machine, nor a body endowed with reasoning faculties. It is violence in its natural state, and it will only yield when confronted with greater violence.\"\r\n\r\n\"Come comrades, the European game is finally over; we must look for something else. We can do anything today provided we do not ape Europe, provided we are not obsessed with catching up with Europe. Europe has gained such a mad and reckless momentum that it has lost control and reason and is heading at dizzying speed towards the brink from which we would be advised to remove ourselves as quickly as possible.\" \r\n\r\n-Frantz Fanon\r\n","spotify_url":null,"youtube_url":"http://youtu.be/ohoiW9HrXkc","wayoutwest_url":"http://wayoutwest.se/artist/concerning-violence?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/cv_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":82,"title":"Lorentz","content":"Despite the fact that he’s only 22 years old Lorentz have already spent over five years in the spotlight as half of the Grammis winning and platinum selling hip-hop duo Lorentz &amp; Sakarias, together with his brother Martin Sakarias. After two acclaimed chart-topping albums, the 2009 debut “Vi mot världen” and its follow-up “Himlen är som mörkast när stjärnor lyser starkest”, Lorentz is now stepping out on his own.\r\n\r\nOn his debut single “Visa mig vägen”, released at the end of March this year, Lorentz leaves the rap behind to sing about the perfect moment, the one in need of no change whatsoever. His full-length debut album, which features guests like Say Lou Lou, is due later this year and is definitely one of the most anticipated Swedish releases of the year, a record that moves from light to dark and a showcase of one of Sweden’s most important artists right now\r\n","spotify_url":"http://open.spotify.com/artist/2QDnY1LY2mnzeeKGZLHoc7","youtube_url":"http://youtu.be/VbCknUw30Jo","wayoutwest_url":"http://wayoutwest.se/artist/lorentz?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Lorentz-3---Foto-Patricia-Reyes-web.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":84,"title":"Yumi Zouma","content":"If you thought it was only Lorde that came out of New Zealand, you would be wrong. The dreamy-pop trio Yumi Zouma, made up of Charlie Ryder, Kim Pflaum and Josh Burgess started life there too. It is only Pflaum who still resides their however, the rest of the band are now scattered between France and the US and the cause of this global scattering? The 2011 Christchurch earthquake that destroyed they’re shared home.\r\n\r\nTheir home may have been destroyed but true creative bonds are not so easily tumbled and the band now find themselves operating via Dropbox and email. In a way, the circumstances seem to aid in the creation of the hazy, melancholy sounds that seem and probably are made in the early hour befuddlement of trying to work to varying time zones.\r\n\r\nTheir self-titled EP (issued by Cascine) has four tracks that have a distinctly nostalgic feel, epitomised by the distinctly 80s-esque lady on the records cover. It also seems a grand departure for Ryder and Burgess who were both previously of NZ disco-punk band Bang! Bang! Eche!  But their about turn from this prior incarnation to Yumi Zouma has led to the creation of wonderful tracks– in a style that The Guardian newspaper have described as ‘serene disco’. \r\n","spotify_url":"http://open.spotify.com/artist/4tPyCwWrsvZ8OKYl7QRavL","youtube_url":"http://youtu.be/3CG08s-Jpug","wayoutwest_url":"http://wayoutwest.se/artist/yumi-zouma?lang=en","artist_url":"https://soundcloud.com/YumiZouma","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/YumiZoumahemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":85,"title":"Pional","content":"Pional is one of Spain’s most talked about new stars of the electronic music scene. This multi-instrumentalist had already debuted under the alias Alt Fenster back in 2006 on labels such as Proton, Traum and his friend John Talbot’s Barcelona-based company Hivern Discs. However, it wasn’t until 2010 that his career really took off with the EP  ‘A Moot Point’ (Hivern Discs) and the success of singles like ‘ In Another Room’ and ‘We Have Been Waiting For You.’\r\n\r\nPionals understated but totally hypnotic sound captivated DJs, the media and music lovers alike, and Pional soon found himself on many ‘best of the year’ lists. Together with his artistic partner John Talbot, this young Madrid gent has really put Spanish electronic music on the map. Besides playing at the legendary Boiler Room and many of the big clubs across Europe, he has done remixes for none other than Little Dragon and Phoenix, released the acclaimed EP ‘Invisible/Amenaza’ (Young Turks) and together with Talbot, supported The XX in Europe and the USA.\r\n\r\nOne of Pional’s (aka Miguel Barros) strongest traits is his voice, a fact that is patently evident on ‘Destiny’ from his debut album ‘Fin’. His compositions are genuine jewels of house, disco and pop, shaken into a wondrous musical cocktail that is very much his own. He has that special ability to appeal to a wide audience without ever compromising on his originality.\r\n","spotify_url":"http://open.spotify.com/artist/49mZfy9v5oNXAxp8FadWwI","youtube_url":"http://youtu.be/J2PtPBOmh1s","wayoutwest_url":"http://wayoutwest.se/artist/pional?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Pionalhemsida.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":86,"title":"Jamie xx","content":"Jamie xx is the kind of guy that is hard to pinpoint, but at the same time that is what makes him so cool. He grew up on jazz and soul, started making some hip-hop beats and became a member of an indiepop band. He straddled various parts of the electronic music scene and in doing Jamie Smith became a master of everything – you never know if it is a steel pan, a soft vowel or a sub-bass that will hit your hardest, or possibly all three simultaneously. As beat creator for lo-fi indiepop band The xx, he created (together with Oliver Sims, Romy Madley Croft and Baria Quereshi) one of the decades most well received albums. Their self-titled debut album, released on XLs imprint label Young Turks, won awards, featured on various ‘best of the year’ lists and took the band all over the globe to festivals such Coachella, Glastonbury, Primavera, Lollapalooza and of course Way Out West.\r\n\r\nWhile the band took a break before their sequel in 2012, Jamie xx continued to carve out his own place in the industry. He became a much sought after remixer for pop stars such as Adele, Jack Penate, Eliza Doolittle, Radiohead and Florence + the Machine. He created an entire remix album for Gil Scott-Heron and has also collaborated with Drake, Four Tet and Caribou. His solo single, ‘Far Nearer’, released on Numbers, came with a danceable sound that not only drew him closer to the more club orientated audiences, but placed him as one of the electronic music scenes hottest artists. His futuristic garage/UK bass/dubstep influenced remixes, house sets on the BBC as well as at the Boiler Room have made him one of Europe’s most popular DJs. \r\n","spotify_url":"http://open.spotify.com/artist/7A0awCXkE1FtSU8B0qwOJQ","youtube_url":"http://youtu.be/PaXslpx3MWY","wayoutwest_url":"http://wayoutwest.se/artist/jamie-xx?lang=en","artist_url":"http://www.jamiexx.com/","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Jamiexxhemsida.jpg","favorites":8,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":87,"title":"Studio Barnhus: Axel Boman, Kornél Kovács, Petter Nordkvist","content":"A record label, studio and Dj trip, delivering so much more than music alone. When Kornel Kovacs, Petter Nordkvist and Axel Bornan get things going, we can assure you no one will be moping in the corners.\r\n\r\nThe Stockholm-based sound collective has kept dance floors packed since 2010 and the Red Bull Music Academy stage at Way Out West will be no exception.\r\n\r\nExpect house beats, avant-garde techno, pop references, neon colours and just plain old happiness.\r\n","spotify_url":"http://open.spotify.com/artist/59qo8jHDlC1i30HVjQQW3O","youtube_url":"http://youtu.be/AkWliJKSgUs","wayoutwest_url":"http://wayoutwest.se/artist/studio-barnhus?lang=en","artist_url":"https://soundcloud.com/studiobarnhus","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Studio Barnhus.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":88,"title":"Seinabo Sey","content":"Some find their voice early. For others it can take a long time. Seinabo Sey is one that found her voice early.\r\n\r\nShe found it in the music that was played in her home growing up in Gambia, Halmstad and then Stockholm. She found it in the records of Lauryn Hill and Destiny’s Child when she started to write her own music, and when she was touring with Oscar Linnros and Maskinen, in meetings and collaborations with Stor and Linda Pira. She found it when she met producer and songwriter Magnus Lidehäll of Mapeo and Veroncia Maggio.\r\n\r\n‘Younger’ Seinabo Sey’s first single in collaboration with Lidehäll is an explosive pop song that combines her incomparable vocals with sophisticated and contemporary production, once again showcasing why Sweden is one of the leading producers of great pop music.\r\n\r\nThe single ‘Hard Time’ is further proof of why she is being hailed as one of this year’s breakthrough acts. It’s a statement, in a time when clear messages are few and far between in pop songs, Seinabo speaks to the listener with powerful words, heavy with significance. 2014 may be the year for many, but standing in front of all of them is Seinabo. Just listen and you’ll hear why\r\n\r\nThis summer Seinabo Sey is playing only one show. Our show. She will be hitting the stage at Stay Out West, the club section of Way Out West, and it’s guaranteed to be one of the best shows you will see for some time.\r\n","spotify_url":"http://open.spotify.com/artist/4X0v8sFoDZ6rIfkeOeVm2i","youtube_url":"http://youtu.be/GI5E5ewwN1s","wayoutwest_url":"http://wayoutwest.se/artist/seinabo-sey?lang=en","artist_url":"http://www.seinabosey.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/SEINABOhemsida.jpg","favorites":4,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":89,"title":"Kurt Vile &amp; The Violators","content":"Sitting on the pavement outside a convenience store drinking cherryade. Surfing. Checking out a new band at the late club-nights. Sticking your head out of the car window. Dandy Warhols and Dinosaur Jr playing on the pickups truck stereo. Smoking a rollie in the garden. Looking at the big city silhouetted against the sky when evening becomes night. Burritos on the beach. The morning sun seeping in, to wake you in your dishevelled bed.\r\n\r\nKurt Vile's dreamy psychedelic American indie is the kind of music that warrants these types of, somewhat cliché ridden, cinematic imagery of young American culture. Since Kurt Vile left The War on Drugs he has created a detail rich indie rock that is strangely evocative and cinematic. Relaxed but not passive, soft but not weak, sunny but not hot, detailed and well composed without being too clever for its own good.\r\n\r\nThe mood that Vile and Violators is more reminiscent of movies like ‘Dazed and Confused’, ‘Lords of Dogtown’ or ‘American Graffiti’ than any musical reference.\r\n\r\nIt’s enjoyable. Close to life. It makes you want to crawl into his music like a hammock and just be there for a moment. Kurt Vile sounds how we want Sundays to feel.\r\n","spotify_url":"http://open.spotify.com/track/3cSlU4ZH4wzb5pM7wI1k3f","youtube_url":"http://youtu.be/RDgHNbpltho","wayoutwest_url":"http://wayoutwest.se/artist/kurt-vile?lang=en","artist_url":"http://kurtvile.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/kurtvilehemsida.jpg","favorites":4,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":90,"title":"Nils Frahm","content":"Berlin-based Nils Frahm is one of those geniuses that refuse to be tied to genres or norms. His music has grown organically from one acclaimed album to the next. Clearly inspired by Steve Reich’s monotonous piano styling’s, he pushed even further and created his own way, equal parts dreamy and yet deeply melancholic. This is music that your mind can fade away to and reveal parts of yourself that you never even knew existed. Maybe because it doesn’t resemble anything you have really heard before.\r\n\r\nFor piano is to Frahm, not a static instrument, its wood, keys and blemishes are just as important as the sounds it plays. Unconventional and unconcerned, his acclaimed debut album ‘Felt’ from 2011 was recorded with the keyboard wrapped in a blanket, ‘so as not to disturb the neighbours’. The result? A heart-breaking embrace of the night, with noises, breathes and keys clinking. When he later injured his thumb he made the incident the focus of his follow-up album, ‘Skrew’ from 2012, a reference to the four screws he had to have inserted.\r\n\r\nHis much-lauded live album ‘Spaces’ from 2013 gives us a taste of what we can expect from him as he enters Stay Out Wests new stage at the Gothenburg Opera House: a heartfelt mixture of electronic mediations, playful melancholy, technical perfection and of course the piano. Always the piano. \r\n","spotify_url":"http://open.spotify.com/artist/5gqhueRUZEa7VDnQt4HODp","youtube_url":"http://youtu.be/dIwwjy4slI8","wayoutwest_url":"http://wayoutwest.se/artist/nils-frahm?lang=en","artist_url":"http://www.nilsfrahm.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/nils_frahm_hemsida.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":91,"title":"Marlene","content":"Swedish pop darling Marlene says that if the sunset would have a soundtrack it would be sampled in most of her songs, mixed with raw R&amp;B beats, melodic keys and daydreams of skyscrapers, beach parties and a bit of homesickness. The debut EP, which will be released on May 16th, includes her new single 'Indian Summer', the two new tracks 'I Do This For You' and 'Lavender Fields' together with previous singels 'Bon Voyage' and 'Stay Awake'. On 'Indian Summer EP' Marlene has collaborated with producers Elof Loelv (Rihanna, Icona Pop), Oskar Sikow (Erik Hassle, Kate Boy), Jake Oh (Maskinen, Ansiktet) and Tepr (Yelle) &amp; Myd (Club Cheval, Brodinski). The release of 'Bon Voyage' back in August 2013 followed by 'Stay Awake' in January 2014 was a kick start for Marlene's career, earning her ’Best Add Of The Week’ by Swedish national radio P3 on both singles. International blogs supported her from day one hyping her as the next big Swedish music export. \r\n\r\nSince her debut single Marlene has continued her journey both geographically and musically, with focus on finishing her debut EP. ‘I see this EP as a diary of my last year’ Marlene says, ‘...how me and my songs have traveled from a dark basement in Stockholm, via Paris to L.A. and then back to Stockholm again and now I'm ready to show it to the rest of the world!’ \r\n","spotify_url":"http://open.spotify.com/artist/0pAV5GaO9ak8wk1NnF37Cl","youtube_url":"http://youtu.be/Ez7fB0paaWg","wayoutwest_url":"http://wayoutwest.se/artist/marlene?lang=en","artist_url":"http://www.marleneofficial.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Marlene-hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":92,"title":"Zhala","content":"Zhala’s haunting and evocative melodies are packed with a serious punch, full of thought-provoking lyrics and undeniable hooks. Using Stockholm as her base, but with the mindset of a modern day transnational, Zhala’s music is futuristic, labeled by the artist herself as “cosmic pop.”\r\n\r\nZhala (Rifat) was born and raised in Stockholm, Sweden. She became very involved in the local art and club scene and further developed her talents as an artist through dance, singing and her live shows. This path eventually led to her being signed to Konichiwa Records in 2012.\r\n\r\nWhile recording the music for her first release, Zhala continued to tour - playing several festivals (Bestival, Isle of Wight, Way Out West), a unique performance at the Jean Paul Gaultier exhibit at Stockholm’s Moderna Museet, and most recently, an opening slot for Robyn in London, Berlin and Stockholm. The darkly epic track “Slippin’ Around” emerged online at the start of 2012 with a creepily striking video, alerting the likes of My Old Kentucky Blog, Discobelle and The Line of Best Fit that there was a new and unusual popstar about to emerge.\r\n\r\nZhala’s first EP, “Prophet,” was released earlier this year, and more music is scheduled for later this year. \r\n","spotify_url":"http://open.spotify.com/artist/2vI70V5Tc6jB3d2uzb2UEA","youtube_url":"http://youtu.be/MTV3KMbYV14","wayoutwest_url":"http://wayoutwest.se/artist/zhala?lang=en","artist_url":"https://www.facebook.com/zhalaofficial","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/zhalahemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":93,"title":"Hurula","content":" \r\n\r\nMusic doesn’t start revolutions but it's a step in the right direction.\r\n\r\n \r\n\r\nHurula’s first single ‘Sluta Deppa Mig” was released on the 22nd January. He was born and raised in Luleå and then made the move to Umeå, where he became a staple part of the music scene there.\r\n\r\nHurula previously played in, among other, The Vicious, Regulations and most recently Masshysteri, who released two great albums back in the late noughties on Ny Våg in Sweden and Feral Ward in the USA. Masshysteri managed to break through the language barrier and toured both in the USA and Europe despite having songs in Swedish. However, after two intense years together, the band imploded.\r\n\r\nSince then, Robert Hurula left Umeå for Stockholm and switched from the companionship of band-life to heading out on his own. His solo album was recorded with Måns Lundberg who also produced Masshyteria’s final album and most recently Swedish icon Håkan Hellströms ‘Det kommer aldrig vara over för mig’.\r\n\r\nThis solo album debut is a step in a new direction for Hurula, no trends or gimmicks here, just pure relentless rock in Swedish.\r\n","spotify_url":"http://open.spotify.com/artist/5haVwjDd8z1dsR0uQewwoP","youtube_url":"http://youtu.be/utH-IseGguY","wayoutwest_url":"http://wayoutwest.se/artist/hurula?lang=en","artist_url":"https://www.facebook.com/hurulaofficial","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/hurula_hemsida.jpg","favorites":3,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":94,"title":"Nicole Sabouné ","content":"","spotify_url":"http://open.spotify.com/artist/2lPG3ptKlBdxvQ8XlH8nEk","youtube_url":"http://youtu.be/FR2YFNa-gWQ","wayoutwest_url":"http://wayoutwest.se/artist/nicole-saboune?lang=en","artist_url":"http://nicolesaboune.se/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/NICOLE_SABOUNE_hemsida.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":95,"title":"Cleo, Kristin Amparo &amp; Broke 'n Tipsy","content":"Cleo &amp; Kristin Amparo are a unique pair in the Swedish hip-hop and soul scene that’s making waves in Sweden with their amazing live show. Last summer, they teamed up with producer duo Broke 'n Tipsy to work on their EP \"Vem E han\" which also features star producer Style Of Eye (Icona Pop \"I Love It\"). With roots in North Africa, Colombia, northern Swedish hip-hop and jazz this team are treading entirely on new ground. Cleo has previously collaborated with Looptroop Rockers in the song \"Hårt mot hårt\" and with Syster Sol with their song “Fatta” which featured in a campaign against sexual violence. Kristin Amparo also performs with her band Combo De La Musica and has collaborated with artists such as Oskar Linnros, Daniel Adams Ray and John De Sohn on the hit song \"Dance Our Tears Away\". Due to Cleo’s reputation of being one of tightest rappers in Sweden, she was invited to perform in the biggest television programme in Sweden, Melodifestivalen. Krisitn Amparo who’s been called “The closest thing Sweden has, if you would combine Ella Fitzgerald and Amy Winehouse” – Dagens Nyheter 5 out 5. Both of the artists were also involved in a significant musical exchange programme in South Africa called “KWAAI”. The exchange resulted in a Mixtape and successful tour. The producers behind the EP, Broke'n Tipsy, consist of Hannes Lidén and Bessem Bedziri (Supersci). The duo hails from Sundsvall but are now Stockholm-based. Last spring, they released their critically acclaimed \"Mixtape One\", according to hip-hop magazine Kingsize was one of 2013 year's best releases. The last song on the EP, \"Kär och galen\", is a hit on the dance floors and produced by Style of Eye. \r\n\r\n \r\n\r\nTheir EP \"Vem E han\" is something that hasn’t been done in Swedish hip-hop before. The music is full of movement - between deep vibrant soul and hardcore club beats. Blending hip-hop and Afro rhythms while unfolding it into an electronic sound. Their lyrics are a perfect mixture of being personal, strong, expressing feminist values and at the same time keeping it light-hearted.\r\n","spotify_url":"http://open.spotify.com/artist/1Uwxr18BU3oKllK1ipkEef","youtube_url":"http://youtu.be/JoRHGimFEJo","wayoutwest_url":"http://wayoutwest.se/artist/cleo-kristin-amparo?lang=en","artist_url":"http://www.cleomusic.se/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/AllaFoto-SotarnOtf.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":97,"title":"INVSN","content":"","spotify_url":"http://open.spotify.com/artist/0QT3ZWrppXpw96ZbC2LcSl","youtube_url":"http://youtu.be/npExSHWYeqs","wayoutwest_url":"http://wayoutwest.se/artist/invsn?lang=en","artist_url":"http://invsnmusic.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/invsn_hemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":98,"title":"Annika Norlin","content":"","spotify_url":"http://open.spotify.com/artist/5BEuyZUof5F3Nu9pjcWwD1","youtube_url":"http://youtu.be/ojE7J6O1D6A","wayoutwest_url":"http://wayoutwest.se/artist/annika-norlin?lang=en","artist_url":"http://www.hellosaferide.com","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/20140525_annika_norlin_5419-web.jpg","favorites":3,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":99,"title":"Markus Krunegård","content":"","spotify_url":"http://open.spotify.com/artist/3P6ePaE5unCm7vjccfcBAe","youtube_url":"http://youtu.be/pqSVaevSs2s","wayoutwest_url":"http://wayoutwest.se/artist/markus-krunegard?lang=en","artist_url":"https://www.facebook.com/MarkusKrunegard","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/markuskrunis-web.jpg","favorites":4,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":100,"title":"Mattias Alkberg/Södra Sverige","content":"","spotify_url":"http://open.spotify.com/artist/5p8AjcGi5g19fWNvC2zhqE","youtube_url":"http://youtu.be/yppndzadz_0","wayoutwest_url":"http://wayoutwest.se/artist/mattias-alkberg?lang=en","artist_url":"https://www.facebook.com/MattiasAlkberg","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/mattias-alkberg-södra-sverige-web.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":101,"title":"Slint","content":"“Spiderland”. One of the true classics of the nineties, and of the entire indie rock genre. Slint was formed in Louisville, Kentucky in 1986 and they recorded their debut album “Tweez” with producer Steve Albini the following year, although it wasn’t released until 1989. During four days in August 1990 the band recorded the record that would become their legacy, “Spiderland”, and it was released in spring 1991 on Touch and Go Records.\r\n\r\n“Spiderland” almost single-handedly gave birth to what have become known as post-rock and over its six tracks the band created a new type of sound; taut, haunting and menacing. A sound that has inspired countless acts and which have made “Spiderland” one of the most influential records of the past thirty years.\r\n\r\nSlint disbanded just before the release of “Spiderland”, although its members have since played with acts like The Breeders, Tortoise, Palace, Interpol and Yeah Yeah Yeahs since then. Earlier this year the band released an extraordinary reissue of “Spiderland” and following two short reunions in 2005 and 2007 Slint is finally back.\r\n\r\nA unique chance to experience one of the most important acts in indie rock live – and for the first time in Sweden.\r\n","spotify_url":"http://open.spotify.com/artist/4IwOItqRhsIoRuD5HP4vyC","youtube_url":"http://youtu.be/6yEgcb167k4","wayoutwest_url":"http://wayoutwest.se/artist/slint?lang=en","artist_url":"https://www.facebook.com/Slint","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/slint-1260.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":102,"title":"Future","content":"Atlanta rapper Future released one of this year’s finest hip-hop albums in April with his second album “Honest” and at Way Out West we’ll finally get the chance to see him live. Since 2010 Future, real name Nayvadius Cash, has been releasing a steady stream of mixtapes as well as two studio albums and with his mix of street rap and emotional R&amp;B – making him one of the hottest artists in hip-hop right now.\r\n\r\nAfter signing with Epic Records he released his debut studio album ”Pluto” in April 2012, which featured guest appearances from Drake, T.I., R. Kelly, Snoop Dog and Juicy J. ”Honest”, his second album, finds Future taking the step into the big leagues and it was praised by critics all over the world at release. On the brilliant hard-hitting single ”Move That Dope” Future is joined by Pharrell Williams and Pusha T, and the rest of the album includes guest spots from hip-hop greats like Kanye West, Drake, André 3000 of Outkast, Wiz Khalifa and Lil Wayne.\r\n\r\nWith what might be the best hip-hop album released this year and collaborations with some of the biggest artists in the world – Rihanna, Miley Cyrus, Justin Bieber, Kanye West and Ciara to name a few – under his belt Future is more than ready to take the stage in Slottsskogen at Way Out West.\r\n","spotify_url":"http://open.spotify.com/artist/1RyvyyTE3xzB2ZywiAwp0i","youtube_url":"http://youtu.be/ylbLjXwFVuU","wayoutwest_url":"http://wayoutwest.se/artist/future?lang=en","artist_url":"http://www.futurefreebandz.com","time_start":null,"time_end":null,"type":{"id":1,"title":"WAY OUT WEST"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/futurex1260.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":103,"title":"Holograms","content":"This Swedish punk foursome were all playing in other punk bands when they met whilst working in a factory, but decided to join forces back in 2011. They were signed on the spot when Captured Tracks heard their demo and since then they haven’t stopped playing, touring and recording. Made up of guitarist and vocalist Anton Spetze, bassist and vocalist Andreas Lagerström, drummer Anton Strandberg and with Filip Spetze on synth, these guys create deep, heavy subject-laden tracks with an ease that belies their years. After a back breaking tour that lasted for most of 2012 they returned home, greeted by the darkness of Swedish winter, broke and jobless, but from that desolate descent came their glorious sophomore album, ‘Forever’. A fist-pumping ode to the land of fire and ice they call home, they take on heavy issues with a monolithic confidence reinforced by the coming together of two or three vocals at once, whilst the synth-edge creates just enough lightness within the tracks to not scare of any fans. \r\n","spotify_url":"http://open.spotify.com/album/2x9BqJOjgRRQhOTTJO9qak","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/holograms?lang=en","artist_url":"http://holograms.se/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Holograms_hemsida_KNOTAN.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":104,"title":"Colleagues","content":"Colleagues are somewhat of a mystery to most; back in 2012 they dropped a brilliant electro-pop summer single ‘Parents House’ online, think of a true Swedish synth-filled, youthful, ‘bring on summer’ kind of vibe that spread like wildfire, and then, well, nothing. They lay very low for a few years with the odd show here and there in their hometown of Stockholm, we say they as we still don’t really know who they are, they have been described as a collective and by their collaborations with artists and film-makers, and um, mimes, that seems like a fitting title. But one thing we do know is that they make the kind of music that sums up what a summer music festival is really all about, long warm days, even longer balmy nights filled with brilliant music, laughter, friends, a summer romance perhaps and just being caught up in a different music-filled world for a few days. Colleagues are flowing guitars and soaring synths, seductive vocals and brooding build-ups and as their recently released single ‘Tears/Parent’s House’ on In Stereo Records proves, they were well worth the wait.\r\n\r\n \r\n\r\n \r\n","spotify_url":"http://open.spotify.com/artist/6tANwKMqvV8oW0b7Np1ETB","youtube_url":"http://youtu.be/FWdq8cMYn7s","wayoutwest_url":"http://wayoutwest.se/artist/colleagues?lang=en","artist_url":"http://colleagues.se/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/colleagues_hemsida_flat.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":105,"title":"Sumie","content":"Sandra Sumie Nagano’s voice is the kind of voice that transports you to a totally different place; it pulls you in and holds you there with its hypnotizingly sparse yet delicate songs all produced solely by her and an acoustic guitar. Her debut self titled album was released last year on Bella Union to rave reviews and heaping praise from Brit muso-magazine Mojo, who described her album as a, “sensationally spine-tingling collection of moments”. You can hear the influences of her favourite artists such as Nina Simone, Billie Holiday and Brian Eno, and yes, she may be the older sister of fellow singer- songstress Yukimi of electro-pop lovelies Little Dragon, but Sumie has created a sound that is all her own. This will be one show you do not want to miss. \r\n","spotify_url":"http://open.spotify.com/artist/1oEHAWdn0GWyRaL8JGOlan","youtube_url":"http://youtu.be/6QEgfocdNc8","wayoutwest_url":"http://wayoutwest.se/artist/sumie?lang=en","artist_url":"http://www.sumienagano.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Sumie-hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":106,"title":"Josefin Öhrn &amp; The Liberation","content":"When Josefin moved from Paris to Gerlesborgs School of Art in Stockholm, she worked in a vinyl store and it was there that she met the friends that would later go onto be The Liberation. She began writing songs with Fredrik Joelson (Mouth, Stina Nordenstam, Binger The Voyager) when they were joined by Per Nordmark of Fireside and others from the Svenska Grammofon Studio – one of Scandinavia’s leading studios –such as Agnes Alden and Henrik Kalkyl Alser. Other musicians are also involved, depending on everyone’s movements, from Mattias Franzen (Johnossi, Miike Snow), Mattias Bergqvist (Sibille Attar, First Aid Kit) and many more. It is a veritable hot house of musical talent.\r\n\r\n \r\n\r\nThey have quickly gained a reputation for hypnotic, explosive and dreamy live shows, likened to everything from Spaceman3 to Hawkwind and Mazzy Star. This year Josefin released the singles ‘Sunny Afternoon’ and ‘Tell It To the Wind’, and her recently released EP ‘Diamond Waves,’ all to rave reviews. Her beautiful, floaty, dreamy sound will find its way on to a full length album at some point next year, but in the meantime come and be hypnotized by the wonder that is Josefin Öhrn and The Liberation. \r\n","spotify_url":"http://open.spotify.com/artist/6ExOR6M5umZFfNgXfjPcex","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/josefin-ohrn?lang=en","artist_url":"https://www.facebook.com/pages/Josefin-%C3%96hrn-The-Liberation/1475587525999064","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/_josefin_öhrn_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":107,"title":"Anders Wendin","content":"The Swedish artist formerly know as Moneybrother wanted a change, after travelling the world on sold out tours, earning himself a Swedish Grammy and critical accolades for his pop and soul influenced crowd pleaser’s (imagine a rather dapper, younger, Swedish Bruce Springsteen, his stage performances were of near legendary status) he wanted to spend time at home. The news that he was to become a father allowed a niggling desire to become a reality, a solo-album in Swedish. And so, in a wonderfully typical Swedish way, he built himself a small studio out in the countryside and along with Henrik Svensson produced an album full of tales of life; the anxieties, the despair and of course the love. It was released in March of this year to great praise and he will be bringing his wonderful life-narratives with him to Stay Out West this Summer, come and be charmed by the lovely Mr Wendin. \r\n","spotify_url":"http://open.spotify.com/artist/3PDQFW0WKHjKs6gY2b2rFJ","youtube_url":"http://youtu.be/zUHDcidD8BQ","wayoutwest_url":"http://wayoutwest.se/artist/anders-wendin?lang=en","artist_url":"https://www.facebook.com/OfficialMoneybrother?rf=103331729699072","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/anderswendin_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":108,"title":"Lilla Namo","content":"Lilla Namo is considered one of Sweden’s most exciting artists, a girl who came from nowhere and was suddenly everywhere, she doesn’t follow the crowd and sings about everything, in her own straight-talking, smack-you-in-the-face kind of way. She doesn’t mix her words and together with the Up To No Good production team her streamlined sounds have been winning her accolades left, right and centre since her debut single ‘Haffa Guzz’ back in 2012. This was followed by ‘Höj Volymen’ which led her to being described as ‘one of the most exciting women in music,’ a nomination for a Swedish Grammy and went on to win her a P3 Gold award. Her ballsy skills, genre flipping style and unforgettable live performances speak for themselves; you do not want to miss this lady at Stay Out West this summer.\r\n","spotify_url":"http://open.spotify.com/artist/2DsNd8GBB1y1J0XMq0nT6s","youtube_url":"http://youtu.be/DDj2Kwlivrk","wayoutwest_url":"http://wayoutwest.se/artist/lilla-namo?lang=en","artist_url":"https://www.facebook.com/lillanamo","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/lilla_namo_hemsida.jpg","favorites":2,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":109,"title":"Christopher Sander","content":"Christopher Sander was primarily known as the lead singer in the Swedish band [ingeting], but back in 2008 he decided to make a detour as a solo artist. A year later he released his debut album ‘Hej Hå’ which contained his very personal interpretations of the music of Georg Ridel, who composed the music for Swedish writer and illustrator Astrid Lindgren films – think Pippi Longstocking and you’ll get the gist - as well as early 80’s alt rock band Spaceman3. Not the most expected sources of inspiration but it was nonetheless warmly received by the critics.\r\n\r\n \r\n\r\nNow he is back with his second album ‘Jorden Var Rund’ released on the 2nd May, produced by Jari Haapalainen and with guest turns by some of Sweden’s most inspiring musicians and voices such as Nicolai Dunger, Rebecka Törnqvist and Tuva Novotny. It has been described in a wonderful variety of ways, from ‘ gospel pop’, ‘collective prog rock’ to our personal favourite ‘a Swedish George Harrison’. All we know is that its melodies and rhythms cling to the listener whether they be of joy or grief, this is an album about life and everything that comes with it, with Christopher the knowing narrator. \r\n","spotify_url":"http://open.spotify.com/artist/0LguImbYE4ZsVaSTJAB7YT","youtube_url":"http://youtu.be/nVX3xwNqpyw","wayoutwest_url":"http://wayoutwest.se/artist/christopher-sander?lang=en","artist_url":"https://www.facebook.com/jordenvarrund","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/christopher_sander_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":110,"title":"Les Big Byrd","content":"Swedish psych-rockers Les Big Byrd create a unique mix of vintage sounds, echo-heavy vocals, trippy synths and dark rock, that was showcased in their tightly produced, recently released debut-album, ‘They Worshipped Cats.’ Fronted by Joakim Åhlund and Frans Johansson, who had previously played in touring acts such as Fireside and The Caesars, could not have known what the future held for them when they joined forces back in 2011. Whilst hanging around a record store one day they bumped into Anton Newcombe, touring with Brian Jonestown Massacre, and after a no-doubt lengthy chat about records they were invited to jam with the band for a few days in Newcombe’s Berlin studios. The result is their current album, overseen by Newcombe himself it has scored rave reviews for their experimental rock as well as a support slot for the boys with Newcombe and the band on their summer tour. This is one you do not want to miss. \r\n","spotify_url":"http://open.spotify.com/artist/3g2slv6elrXxGnXqy7Q2ap","youtube_url":"http://youtu.be/X9HfTstqDMM","wayoutwest_url":"http://wayoutwest.se/artist/les-big-byrd?lang=en","artist_url":"https://www.facebook.com/lesbigbyrd","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/lesbigbyrd_hemsida.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":111,"title":"Broken Twin","content":"Broken Twin is the pseudonym of the Danish singer-songwriter Majke Voss Romme who creates beautifully haunting and cinematic indie-pop songs. Her distinctive, tremoring vocals are accompanied solely by piano and strings, forming a simplicity that somehow makes her songs both powerful and fragile at the same time. They fill your mind with visions of melancholy and loneliness that seems fitting to the vast open spaces of Scandinavia, the open spaces that as a teenager in a small town, Romme tried to get away from, city hopping until she found one big enough to let her disappear into the crowds, the country’s capital Copenhagen. Her self-produced debut album ‘May’, mixed by Ian Caple of Kate Bush fame and Brian Batz was released in May of this year and has already reaped rapturous reviews from the likes of NME and Pitchfork. Let Broken Twin take you away for a while, away from the crowds, just for a little while.\r\n","spotify_url":"http://open.spotify.com/artist/4Y1f57EtKq7YF6DfftpopX","youtube_url":"http://youtu.be/sg8gs88W51o","wayoutwest_url":"http://wayoutwest.se/artist/broken-twin?lang=en","artist_url":"http://brokentwin.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Broken Twin_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":112,"title":"1987","content":"When the first single dropped there was a shroud of mystery surrounding the identity of the man behind the voice, no grand marketing scheme was rolled out and the press photo’s showed a rather intimidating faceless hoodie. Soon though, the secret was revealed and out from the shadows stepped Victor Holmberg, a music producer and one half of the Swedish dance-producer duo Montauk. Somewhat surprisingly, the mystery was not some too-cool-for-school gimmick, but rather a little insecurity coming through as to how people would react to his new project, but he shouldn’t have worried, his first single ‘Oceans’ - released on Scandi pop-powerhouse label Hybris last Autumn – received quite the accolade with its melancholic RnB musings and had a strong support base in respected Swedish music platform PSL. While his latest single ‘Michelle’ has a similar melancholy vibe that builds to a dreamy synth-filled symphony. Catch 1987 at Stay Out West this summer, he’ll no doubt be the guy in the hoodie.\r\n","spotify_url":"http://open.spotify.com/artist/1RTAxeIlQqWBYZoJVHJJvQ","youtube_url":"http://youtu.be/o4jz8tBe6AU","wayoutwest_url":"http://wayoutwest.se/artist/1987?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/1987_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":113,"title":"Cristian Dinamarca","content":"Since the tender age of 13 the stage has been set for Cristian Dinamarca. Club goers in his hometown Stockholm has recognized the curly hair and big smile behind the decks for a long time but few knows that he's also one of the architects in the Swedish club collective ‘Svensk Bas’ and the man behind disco rapper GNUCCI's latest effort ”Psychohappy EP”. His music roots in classic rave culture blended with modern soul and RnB with a sting of Latin influences that forms into a dreamy, energetic sound right on the cutting edge of modern bass music. \r\n\r\nDinamarca released his first EP ‘Rey’ already in 2012 on the Finnish dance label Top Billin’ which became widely received by DJs and club kids alike.The year of 2013 proved to be another victory lap for Cristian as he managed to start his own record label known as ‘Svensk Bas’ together with DJ/Producer genius Marcus Price. The label has released two compilations, which features two new tracks from Dinamarca showcasing his ever-evolving sound. A whole new EP from Cristian is also expected to be released in fall 2014 – so get ready to move your hips.\r\n\r\nCristian’s DJ-sets are hypnotic, dreamy and mixed with funky rhythms that focus on moving the lower parts of your body. Through genres, space and through time, a night with Cristian Dinamarca will probably be one you will tell your kids about.\r\n","spotify_url":"http://open.spotify.com/artist/6wAIR0sfzXRdiDBu65qSpp","youtube_url":"http://youtu.be/gkYCAqhT65g","wayoutwest_url":"http://wayoutwest.se/artist/cristian-dinamarca?lang=en","artist_url":"https://soundcloud.com/cristiandinamarca","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/dinamarca_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":114,"title":"Beatrice Eli","content":"Within the space of three minutes Beatrice Eli can win over any listener and make resistance futile. With a heavy beat that keeps your heart rate steady and a voice that penetrates straight to your soul, she steps confidently into your consciousness. With her black love song ‘The Conqueror’ in 2012 she became one of Sweden’s most interesting artists. No Contest.\r\n\r\nIn not time at all Eli has laid the groundwork for a career that has a range as vast as that of Björk; experimentation wildly copulates with desire, its pop but in a distilled form that springs forth from a place of eclecticism, with soulful wonderings working side by side with draping melodies and an RnB sassiness. Icons like The Notorious B.I.G and Janet Jackson may cast their shadows on her work, but Beatrice Eli ultimately carries her own torch and she is ready to light up the world and with her latest album ‘Girls’ she is definitely doing just that.\r\n","spotify_url":"http://open.spotify.com/artist/1lzoEy8yiIBiHOuaO4h5Wj","youtube_url":"http://youtu.be/Orffm0v0mS0","wayoutwest_url":"http://wayoutwest.se/artist/beatrice-eli?lang=en","artist_url":"https://www.facebook.com/BeatriceEli","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/beaticeeli_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":116,"title":"Dante","content":"Dante Kinnunnen may have been known as the youngest member of the much celebrated pop band The Concretes, but that all changed when he started to release his solo material back in 2011. Starting with his first single ‘Runners’, which received a huge amount of air play both in his native Sweden and abroad, as well as quite a bit of hype when his single was announced as ‘Song of the Year. But he took this in his stride and continued working from a small, borrowed studio for the release of his EP ‘Next To You’. Fast-forward to 2014 and his album ‘Trillion’ has just been released on Baseline Music to rave reviews. He produces all of his own work and is said to be influenced by artists such as Drake, The Dream and other RnB lovelies, but our favourite description is that he is ‘a perfect mix of Phil Collins and The Weeknd’. Whatever he may be, his tunes have summer vibes written all over them, come and revel in them at Stay Out West.\r\n","spotify_url":"http://open.spotify.com/artist/6pLczwiw7MRvvstnzGrp7A","youtube_url":"http://youtu.be/Iw-6NVLh7Cs","wayoutwest_url":"http://wayoutwest.se/artist/dante?lang=en","artist_url":"http://dantedantedante.com/","time_start":null,"time_end":null,"type":{"id":2,"title":"CLUB"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/Dante_hemsida.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":117,"title":"Pine Ridge","content":"","spotify_url":null,"youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/pine-ridge?lang=en","artist_url":"http://www.pineridgefilm.com","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/pine_ridge_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":118,"title":"7 Streck","content":"","spotify_url":null,"youtube_url":"http://youtu.be/MaDU-1ja_DY","wayoutwest_url":"http://wayoutwest.se/artist/7-streck?lang=en","artist_url":"http://7streck.se/","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/7streck_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":119,"title":"As Old as my Tongue","content":"","spotify_url":"http://open.spotify.com/artist/1PGr1fHQVNKnggMkrirgqw","youtube_url":"http://youtu.be/LtHYfKofsi0","wayoutwest_url":"http://wayoutwest.se/artist/Bi-Kidude?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/bi_kidude_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":120,"title":"Jimi: All Is By My Side","content":"","spotify_url":"http://open.spotify.com/artist/776Uo845nYHJpNaStv1Ds4","youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/jimi-all-is-by-my-side?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/jimi_all_is_by_my_side_press_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":121,"title":"Our Vinyl Weighs a Ton","content":"Documentary, USA 2013/2014\r\nDirector: Jeff Broadway\r\nCast: Peanut Butter Wolf, Madlib, MF Doom, Dam­Funk, Mayer Hawthorne, Kanye West, Common, Talib Kweli, Questlove, Tyler The Creator, Earl Sweatshirt, Ariel Pink, Geoff Barrow, A­Trak\r\nMusic: Madlib\r\n\r\nOur Vinyl Weighs A Ton is a feature-length documentary about avant-garde Los Angeles-based record label Stones Throw Records. The film weaves together rare concert footage, never-before-seen archival material, inner-circle home video and photographs and in-depth interviews with the artists who put Stones Throw Records on the map. Our Vinyl Weighs A Ton gives an exclusive look into the label’s left-of-center artists, history, culture, and global following.\r\n\r\nThe film features exclusive interviews with Kanye West, Snoop Dogg, Common, Questlove, Talib Kweli, Mike D (The Beastie Boys), Tyler the Creator, and many more.\r\n","spotify_url":"http://open.spotify.com/artist/5LhTec3c7dcqBvpLRWbMcf","youtube_url":"http://youtu.be/rwZVV_77MhM","wayoutwest_url":"http://wayoutwest.se/artist/Our-Vinyl-Weighs-a-Ton?lang=en","artist_url":"http://ourvinylweighsaton.com","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/ourvinyl_web2.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":122,"title":"Russell Brands the bird","content":"Nordic Premiere\r\nDocumentary, US 2014\r\nLength: 16 min\r\nDirector: Ondi Timoner\r\nCast: Russell Brand\r\n\r\nComedian, Philosopher &amp; Revolutionary Russell Brand is a unique voice, who challenges mainstream norms onstage and online. The final installment of the CEA (Chief Executive Artist) triptych from A TOTAL DISRUPTION follows Brand as he ventures into Twitter headquarters, which he promises will cause “a glitch in the matrix.” We safari behind the veil of the world’s most popular micro-blogging platform through his eyes, culminating in a disruptive performance on their main stage.\r\n\r\nOndi is also working on a feature length doc on Russell Brand, to be released in 2015. \r\n","spotify_url":null,"youtube_url":"http://youtu.be/ieFYmdkIToM","wayoutwest_url":"http://wayoutwest.se/artist/Russell-Brands-the-bird?lang=en","artist_url":"http://www.russellbrand.com","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/RUSSELL-BRAND_web.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":123,"title":"Amanda F---Ing Palmer On The Rocks","content":"Nordic Premiere\r\nShort Documentary, US 2014\r\nLenght: 18 min\r\nDirector: Ondi Timoner\r\nCast: Amanda Fucking Palmer\r\n\r\nThe 2nd CEA (Chief Executive Artist) short of the triptych from A TOTAL DISRUPTION follows punk-cabaret icon, Amanda Palmer, as she hits the stage at Red Rocks Amphitheater, while delving into the journey that followed her record-breaking $1.2 Mil crowd-funded Kickstarter campaign, in which Palmer (formerly of the Dresden Dolls) masterfully uses technology to create direct and meaningful relationships with her fans, while redefining the role of the artist in our society and the rules of engagement between artist and audience.\r\n","spotify_url":"http://open.spotify.com/artist/726Dh6A5VyDfAAQxilT6A0","youtube_url":"http://youtu.be/HiqOwlXj5ys","wayoutwest_url":"http://wayoutwest.se/artist/Amanda-F---Ing-Palmer-On-The-Rocks?lang=en","artist_url":"http://amandapalmer.net","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/amandapalmer_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":124,"title":"Obey The Artist","content":"Nordic Premiere\r\nShort Documentary, USA 2014\r\nLength: 16 min\r\nDirector: Ondi Timoner\r\nCast: Shepard Fairey\r\n\r\nFollow world-renowned graphic disruptor, Shepard Fairey, as he transforms a digital print by Aaron Huey into a remarkable 12­-foot mural in downtown Los Angeles and then brings it back to the Internet to maximize its impact globally. OBEY THE ARTIST is the first of a triptych of CEA (Chief Executive Artist) shorts from A TOTAL DISRUPTION, looking at how this groundbreaking artist embraces technology to innovate his independence and amplify his message on social issues.\r\n\r\nWill be screened together with AMANDA FUCKING PALMER ON THE ROCKS &amp; RUSSELL BRANDS THE BIRD\r\n","spotify_url":null,"youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/Obey-the-artist?lang=en","artist_url":"http://www.obeygiant.com","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/obeytheartist_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":125,"title":"Beautiful Noise","content":"Nordic Premiere\r\nDocumentary, US 2014\r\nDirector: Eric Green\r\nProducer: Sarah Ogletree\r\nMusic: Cocteau Twins,The Jesus and Mary Chain, My Bloody Valentine and many others\r\n\r\nThe definitive documentary about influential 80’s and 90’s guitar bands who harnessed massively loud sounds using a sea of effects pedals and delivered some of the most BEAUTIFUL NOISE ever recorded.\r\n\r\n8 years in the making, with over 50 interviews, band members, music icons and tastemakers.\r\n\r\nBEAUTIFUL NOISE is an in-depth exploration of a music movement in the late 20th century, a fascinating period when some innovative musicians mixed guitar noise into conventional pop song structures while maintaining a philosophy of letting the music speak for itself. Although many of the people interviewed are notoriously press shy they have opened up about their music and experiences from over 20 years ago; how they defied the rules and became sonic innovators that have inspired so many.\r\n","spotify_url":null,"youtube_url":"http://youtu.be/FDevDeoLgaE","wayoutwest_url":"http://wayoutwest.se/artist/beautiful-noise?lang=en","artist_url":"http://www.beautifulnoisedocumentary.com/","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/beautiful-noise.jpg","favorites":1,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":126,"title":"Sønner av Norge","content":"","spotify_url":null,"youtube_url":"http://youtu.be/cStlgJgUx6c","wayoutwest_url":"http://wayoutwest.se/artist/Sonner-av-Norge?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/revolt2_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":127,"title":"Tusen Bitar","content":"","spotify_url":"http://open.spotify.com/artist/0PXQ16KY3iwdfvluCikdn0","youtube_url":"http://youtu.be/pyDqHBxAZNI","wayoutwest_url":"http://wayoutwest.se/artist/tusen-bitar?lang=en","artist_url":"http://www.bjornafzelius.com","time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/pressbild_tusenbitar_web.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}},{"id":128,"title":"Viva Hate","content":"","spotify_url":null,"youtube_url":null,"wayoutwest_url":"http://wayoutwest.se/artist/viva-hate?lang=en","artist_url":null,"time_start":null,"time_end":null,"type":{"id":3,"title":"FILM"},"image":"http://cdn.retrofuzz.com/wayoutwest/thumb.php?w=480&amp;src=media/uploads/vivahatestor.jpg","favorites":0,"venue":{"id":null,"title":null,"capacity":null,"status":0,"show_status":false,"queue":null,"visitors":null,"last_update":null}}]